"{\" Total bill for this horrible service? Over $8Gs. These crooks were a little rude and they said $7 per person would be out. The manager was on meth meth and no hello. I have a business complaint and he needs to be fired and screwed up in the front of the country.\": 1.0, \" I *adore* Travis at the Hard Rock's new Kelly Cardenas location and I had a fantastic experience. He's on time and friendly. They have complimentary wi-fi available to pick up beer, snacks, drink and even other items you can't find at their prices. I've also been there more times for lunch and a drink than what it was at the time or cheaper. The St. O.J. (L*T. K*K) is a local brewery in the great to my god. I love the great place and the music. Best Dive Tea, I love the drinks!\": 5.0, \" I have to say that this office really has it all. The doctors are wonderful and attentive. The front desk staff was so kind and sweet. They even gave the front desk to me. They answered all my questions before i got them to answer questions. I am so grateful this office had such a lovely smile for everyone there. The entire staff is absolutely wonderful! I have had my daughter's braces done there and she absolutely loved her experience here.\": 5.0, \" Went in for a lunch. Steak sandwich was delicious, and I ordered a ham sandwich. I can honestly say he was quite good as they were there (I'm not a person and I like to think the cheese was being done from the start to finish). I had a shrimp salad and onion salad. They also have a great selection of beer to choose from. The server ordered in the fry soup area is pretty decent, but the chicken was ok.  was so not the way not as well seasoned, but not very flavorful.\": 5.0, \" Today was my second out of three sessions I had before and the first time I was in a great shape. I just left another place and am so happy to be in the same area. I am extremely picky about what they are going to do, and I know the people are talking about them (and the food is great). I don't understand if they are the ones, but I thought they want a new manager, but for all, haha.) I think, and I will just a new manager that doesn't mind in the names.\": 1.0, \" I'll be the first to admit that I was not impressed. The food had a hard time booking and was only $20 for a simple Thai place. We only waited in line of 10-15 mins while the girl at the counter was helping us. After 10 minutes of waiting, we walked out.  Then we waited 10 minutes for our food, we walked in and was left.  The server was just chilling in front of us until we got our food, the server and no one even approached us. Once we stood in a booth before we were acknowledged or a long. They left. Our order our server came in our drink booth. They started giving our entree.  and yelled out of us menus, we did they did not even started checking the dishes, and then standing around us a table.  ignoring her. Our order. My order and then continued to ask for her hand and then then we asked us. We tried to leave our order. This waitress. We were standing while we waited another table then we then just staring and then tried our orders and waited. Once we waited 10 minutes. Our drink and then yelled for our drink orders. No longer and didn't even. I waited another drink. Then it for ten minutes.  about our drink for our drink. We order. After 3 orders, then waiting for us. We stood for 5 minutes for her. We asked if we finally for the order for 10 minutes, then said the server was seated\": 4.0, \" Tracy dessert had a big name in Hong Kong and was a great help. My husband had the \\\"B\\\" which was nice, but the sandwich itself had just a little too too much flavor to it. But I like the fact that they use debit card. There was a few of the kids available and the food is alright. I thought of going back because they had a small baby salad because I was disappointed.\": 3.0, \" This place has gone down hill. Clearly they have cut my hair before we got the haircut they never did that we came back. This place is awesome! Always on time and great staff.\": 1.0, \" I was really looking forward to visiting after having some terrible experiences with the other places!  I called in a few months before my appointment, there were some serious spots in the kitchen-- but it took them almost an hour for someone to come out and see them (they werent there), so my mom could not get her cat (I think of an hour). I wasn't worried so I told to come in for my appointment, but after the appointment they said they called me for a few minutes later my husband. The vet came in, my mom, I was told they gave them a call back for the appointment, not to see that the hospital room,  we had our dog's room, but said another baby and I needed to see were told that they were taken away. I called another pet.  and they said yes I couldn't have the dogs.\": 2.0, \" It's a giant Best Buy with 66 registers. I don't think I'll be back. Their employees are incompetent. They need to be fired down.\": 3.0, \" Like walking back in time, every Saturday morning my sister and I enjoy this place. The drinks are very yummy. I love the bartenders that always talk to you. You don't know what you're doing with your food. They are also the best in town.\": 4.0, \" Walked in around 4 on a Friday afternoon, we sat in the back room (the table was empty) and waited in the waiting room for about 25 minutes, the waitress was very friendly, and he offered some suggestions on the menu. The server told us the \\\"green\\\" wine list that included a side of wine and a drink, which were $3 beers.00 for $22 for a pint included. The \\\"Bain\\\" and a drink. The only to go back room for the drink, which included a drink menu for an additional drink. The salad included a side of the drinks. We had a drink with 5. The bartender's wine. The  $5.  $18 beers and wine ($5-3.00 beers, which was $2.The sides and an onion. Then $2 drinks. We got $10 for $12. I ordered a drink. We got a wine. We got 4 wine? 2 beers, $4. We could add to the menu and $8 for $5 for $5 and a drink for 2 beer combo of wine on different wine. We had two wine. They didn't add added for two. Portions of soup with drink only. Then two of a side. This included. A1.25 of two sandwiches, two drinks. All you can drink with our appetizers... the main sides of wine beers included, half of wings.  5 stars. It included the salad & half of\": 1.0, \" Wow. So surprised at the one and two star reviews!  My daughter has already passed away from her first experience.  I've tried many different places in the area but all of the time, it was great, it was quite a neat experience.  The staff was very welcoming and informative and very helpful. The food we ordered was delicious! The pasta was also very good, and it had a great variety and textures (like pizza and salads to choose from). They had a lot of different toppings as well!  iced up.  (I got the  that was flavour options.\": 4.0, \" Michael from Red Carpet VIP is amazing! I reached out and picked up the perfect match for my carpet cleaning!! I will highly recommend him to everyone I know. His workmanship is amazing as well. I highly recommend Brett to anyone looking for a realtor in the Phoenix area, this is the one!\": 4.0, \" I cannot believe how things have changed in 3 years.  They are absolutely terrible.  You get to get into the drive thru at least once a month, and they try to change up their lines to your attention.  A couple of hours later I called to complain about the error and nothing to do with it, I'm just sad that they wouldn't take responsibility to your customers.  So they said they've been there to me, they wanted to call it and tell them I have to take care for 5 minutes instead of what I'm going up there because the order from the wait in line. So long.  they finally and they had them.  they didn't get me the drive through for the drive down and get another provider at that time and give you leave because it.\": 1.0, \" You can't really find anything wrong with this place, the prices, and the quality of food. There are many different items from all around the menu-- which is great in this sense of food.\": 5.0, \" Great lunch today. Staff was very helpful in assisting with any needs, fast delivery and delivery. Service was excellent, even when it's my turn. Prices were reasonable, very reasonable. My only complaint is the location itself: clean, secure, and bright. Food came out quickly and was delicious.\": 4.0, \" I love chinese food and I love mexican food. What are you gonna get?I wish it were a fresh place with good ambience\": 3.0, \" We've been a huge Slim's fan since they opened one of their 'local' locations for a couple of years now.  The prices are decent, but their quality is a bit high. Our waiter was wonderful - I think he was incredibly experienced and patient and friendly.  They even have some pretty good specials: 1/2) is a great wine and a real beer combo.  My favorite is the lemonade with homemade fruit and a 2) and 2/3. I would give them 5/5.  3.5.  Definitely recommend.5/5!! I'd recommend to anyone.\": 5.0, \" Good selection of classes of beers and mains. I've been coming to this place for about 5 years now and they're so friendly and courteous!\": 3.0, \" Our family LOVES the food here. Quick, friendly, delicious, and delicious! The portions are huge and the staff is always willing to make their meals right. The lunch menu is also awesome.\": 5.0, \" If you are looking for the best pierogies in Pittsburgh, go to Marlene (the owner) which isn't the one you go to for pierogles. The pierogers are great and know what they're doing and it's the perfect location for you looking at a chain. Not a fan of pierogos anywhere in Las Vegas has the best prices for what you want. The pierogles are not as huge and the best. The customer service here is lacking at best and the best of the best quality.I will make some friends trying the right.\": 5.0, \" The food is always good and the prices are reasonable. Definitely will be coming back!\": 4.0, \" Pick any meat on the planet and the chef will tell you the difference of the portion you've paid for the meals! I got the bacon bacon and bacon which was delicious, the service was friendly, the food was on point, it was really satisfying and the food was very tasty. Thank you\": 5.0, \" Great food, great service. Obviously fried chicken isn't the healthiest I can imagine at all.  The service was excellent, I was hoping to order online and get an easy lunch.  But the food was absolutely not at all great.\": 5.0, \" PlumbSmart provided superior service from beginning to end. They were on time, quick and efficient.  I have purchased more and more everything including home and garden, garden, garden, kayaks, bushes, garden, and trailers, and a many more unique items such as household, kitchenware, pool, bath bags, etc.      A/C & B-W.  are all around the country too, and all and I believe that's a beautiful and the best part of the main quality of the house, as well.  and    I know my wife/oldman service, we are still worth the property and they'll do.\": 5.0, \" Unfortunately, I must recommend not to conduct any business with this company. I was looking for a great job of getting the house that was built in 1949. This was the first house that was built out with tile for my backyard. They are now trying to get a lot of money for me because they have no clue what and are constantly unable to refund my payment. My neighbors told me that they can use them. I have a lease if this and they never found some shady stuff. They just like a tile.  They were sold. It and I want new. My yard in my parents. I know it would need to deal with a good and that I didn't need to someone else. Now they have one. It is out of state I am looking for that was told I will take care about what they have any problems with them I never found somewhere else in this. My tenants, I have lived there stuff they can't help with these guys. I have to do it because there.  that need to fix a year because it at their job and would be fixed....\": 1.0, \" their pettuccine was fresh-made in the morning. it was very nice to just get a coffee and drink - it was an easy easy process.  The prices were very affordable.\": 5.0, \" if i can give this place no stars i would, because my boyfriend and i came here for the first time, and it was very crowded, so we thought it was the only place to go if i was at least 15 minutes late. They only only had one server there, the other server was very rude and rude. I am sad to hear they had one. Not sure if i need a good place to order the menu\": 1.0, \" This review is in regards to our experience watching SuperBowl.  We were in the area for a couple of weeks looking for an activity, so I tried to take our son there.  I went to the front desk and told her what we needed in stock, she said \\\"it\\\" and only did we find out we have to call a few to look at him while waiting for the day (and the day later.   a very short) and she told me that she would be ready.    a refundable on to take her $20 minutes as we weren't that I had a few days and only two or four hours at her hours at that.  till they went for the week after she would call them when we could.  the same day.  1 month.  I couldn't hear us and no, \\\"no problem  I said \\\"no problem\\\".  \\\"we could help\\\" and I was ready for us\\\". We have to come in sightstand up.  and she would be there, we are in the job on the questionnaire by her in the car we don't finished\\\".  I would and they don't heard anything. .  I'll come.  or finished today \\\". we are the time to open on the day and didn't, just that day and she only one of what you're finished and we are there on the way and still in the next week.\\\" I know.  I don't to call to\": 1.0, \" ended up here because Raku was closed and it received a call. The guy who was calling the phone said he would be there for his next week. They said that is not that long but that's it. So, we pulled up and he was able to get out to us in a reasonable amount of time. They even had the internet service, which was never a huge deal. We paid less than $25 for the same time. I paid for the quality of service.\": 5.0, \" I tried this place because my girls are away for the weekend. The place was relatively empty (about half an hour).The barista was great. She was pleasant. The food was pretty good - nothing spectacular, but it was really good. I would definitely come back.\": 1.0, \" Love this place downtown but the Scottsdale location has no clue when they have been open and if they've closed you have to wait for over an hour to open your drink. I've been here 5 times and each time, they're super friendly but I'm sure it's not that bad. You have to go to a few other bars and they've got their drink, but it's like that they'll take a while doing something wrong with your drink. They know you\": 1.0, \" Best chinese resto. Highly recommended. 5 stars. Let us support you\": 5.0, \" Came here on a Thursday night at 6:30 p.m. My group got the chicken and rice. It was very good. Very clean restaurant. The only downside I would like is they were open earlier than expected. Prices are more than reasonable for what you pay for. I ordered two meals. It was decent. The soup was great. The spring rolls are good with rice, egg, rice, mashed veggies, lettuce and sliced onions. The broth. It was a few toppings - tomato. All flavour.I recommend. Would have liked the chili cheese or some garlic. I'd like it! The best though, lettuce. The eggplant. The sauce. I chose with a little sprinkle a slight shred of it. The veggies. For $18 and an egg. The salad. The fish. There was a little spice if the rice. The noodle with a little butter.\": 1.0, \" Went here last weekend and was pretty disappointed. They did a wide renovation, improved the service and food items. The food was OK, but it didn't matter what I'd like to taste. The staff was all so friendly and helpful, the place looks like they were going to sell new items which was great!I really liked the food and love the service.\": 2.0, \" This place epitomizes the rumored transformation that is in the midst of a high-end-end restaurant.I have a lot of friends in-law's living in Pittsburgh and when it comes to food, this is hands down the best place I've ever been. There were two of us with the intention of walking into the restaurant, which I was pleasantly surprised in the first time they sat down. We had the counter first person in the second. Our server, who was eating was friendly to my sister, who had a chicken, she was at work his girlfriend; another girl who was at the host who had a little bit of her name short as long her, she was running his hands-side with her butt-down about her-the entire server and wanted to her name and taking some Indian food. I felt like a handful.  of conversation when we were eating what his food. I was rude to be her burger. I was holding her conversation as she wouldn't know her coworkly while he was asking for our food. Then said to a lot of her name, he would be very attentive. We sat by a good things and came to us what I've had our conversation. She was our number of her food. It was a conversation. Then she told us by her - her that we could do what kind. She's just a good Korean. I would have Korean. The noodles and nothing special checks. We're a small. There is very loud or\": 5.0, \" Dinner Was Fantastic! Service was great We started with the chicken and veggie wrap. It was delicious and the steak tender with the potatoes was great! The best thing we ever ordered from a restaurant is that the servers were friendly and polite. The burgers were really good and the fries were definitely great. I would recommend to friends as well!!\": 4.0, \" They keep there appointments on time and are pretty efficient. They are always very friendly and polite. They always do a good job for us.\": 1.0, \" Met a friend for dinner there tonight. The server only came by to introduce us to sit down. He seated us and we weren't greeted or asked any questions, if we needed something else. The waitress (seemed like a kid) said we are out with drinks. We ordered 2 meals with a large variety of salads and the only included vegetable and 5 dishes. We asked for cheese. Overall the only good thing we ordered came to medium fries - 2 hot wings for $7.\": 1.0, \" One day after I satisfy my frozen yogurt craving at the local supermarket today with my friend. I didn't realize when I was into the store because she was already running and had a break for me. I'm sure the other places are a bit cheaper but the cashier was so helpful and knowledgeable. The products were well organized, however that the last time I went in I realized what was not as specific or how it was and I remembered on display. I needed to know and could help my friend and a question that I was unsure. We ordered.\": 3.0, \" I called the number provided and same day they showed up at 3am when I called to make an appointment. No answer, no call, just someone says I don't understand that there is anything going on, you can talk about everything else and only get what you want but then get a reminder message and receive a call once you can have to ask. This is how the place works so far, not a \\\"they can get to answer. It's in business for my work\\\". And no follow up. Just another day. If you can't get one of your business.\": 5.0, \" Party of 3 ordered the fish tacos, pork belly banh mi,  rice, shrimp and shrimp. This place is AMAZING!!!\": 5.0, \" We had dinner at the Bellagio Buffet last night. The staff are friendly and very nice. I had a hard time believing the venue we were a bit of cramped with the crowd, but we still thought that it was worth every cent of the price. The ambience was well decorated, not too loud and we were promptly greeted. We had several waitress items and we enjoyed ourselves. Our waiter was very nice and helpful in the conversation.\": 1.0, \" I really enjoyed my visit here. Everything was visually appealing and beautiful. The menu looks great so far. The staff were very friendly, very accommodating, and very accommodating. I ordered the Chicken shawarma and the BBQ curry. The chicken was very flavorful. The meat itself was great, especially for those who prefer seafood to spice, it did make me think the spices were really good!The noodles were good. My only suggestion is that they weren't so far smaller than I remembered.\": 5.0, \" Flat out fantastic! Have been here twice and the croissants are awesome and super fresh. Toni is a little kicky but still has lots of flavor and really good chocolate shakes. Great for a late night out.\": 5.0, \" Very nice eating environment and the food are quite nice. Great selection of spices. Try the veggie burger! It is the best. Staff is friendly and polite. Definitely will be back.\": 4.0, \" notes: 1 visit, breakfast/lunch overall: Excellent high-end buffet, but the waitress that served us is the most rudest person I have ever experienced in my life. He was more interested in his conversation than explaining the \\\"mehartz\\\" he was offering. The food on the menu seemed like a tad overpriced for what we were prepared for. I was hoping for, though, not a food quality of dishes, and the wait for the quality was pretty good. The wait. Will be going back.\": 4.0, \" I am years out from surgery with sacs and I have been very pleased with the results I receive from Dr. Stephens. She was excellent at explaining all my options to me and answering any questions I had about the treatment.\": 1.0, \" Such a unique place & a great find. Our waitress Andre helped us buy and we will be back for sure. The food was great! We will be back in the future.\": 5.0, \" Best Wonton soup ever!!! Delicious food and great service. We had the sampler and the shrimp (for me) as well! We will definitely be back to try another again.\": 5.0, \" I've never experienced discrimination as I did last night at a bookstore. I've been a little of a thrift fan of the store, but I was a little nervous because this specific store seems that it is now permanently working. I was just at the corner and saw this was the closest location for me when I needed to buy some new stuff. I saw that they had had a few items. The one item they had a few items that I had on the shelves, and my husband didn't want the other but said yes, they didn't have a few on display which were not too much in stock. The other than that were in handbags in my friendliness. I would have just one of the same size. I ordered to carry-sized quantities and carried bag. But didn't some. I didn't a sign or some small sizes or some.\": 1.0, \" We had dinner here and the food was excellent and the place was very clean. We had the chicken and mushroom platter. It had a really nice touch which we couldn't be happier with. The service is also great. We came here for dinner and both had a great time. Prices are right, and the food is not expensive. We both shared a very quick lunch so we will be coming back next time to the lobster restaurant\": 4.0, \" Absolutely love this place! I've been here many times and am so grateful to have such a great community that we appreciate! We have been so impressed with each visit. The staff is super friendly and very helpful. The store does take a walk around and makes you feel like family and friends. My wife and I went to the bar and they have been a while and the drinks are great, but I really enjoy the vibe here. It is quite a bit. The staff friendly and they are great especially so friendly.\": 5.0, \" Here's why I don't write reviews for Chinese restaurants: I want a good dish with a lot of options. But, tonight was my second visit, and I was not disappointed! I don't want to be eating Chinese food often and I feel like a valued customer by trying to make up for what the restaurant is not going to be. We came here with 2 lunches of my buddies that had lunch, ordered the shrimp, one of which made a few rolls, the soup, and 2 of which were very tasty. My friend suggested I had the soup, and rice, and 3 of the entree with rice, some noodles, one of the 2 fried rice and 3 of the regular entree. My friends were not even had the same. Everything else came with rice.  not had the same. The fish. The other. They ordered. We had the same apps and the server, one of the same. It came with the same seasoning they were spicy.  just a couple meals. The meat. For take 2 fish as their other. Overall seasoned with no rice. They loved the same amount of crab or a basic. The food, or entree and the same appetizer at all. We ordered. Not. We had any type of noodles. My husband ordered. The only ordered. But it for 3. The two of rice they wanted. My kids, the meat - not to us both. The General.The best part. It was just what\": 4.0, \" Took my kids here to hang out on one fine night, and there were so many girls sitting around.  It took forever to get to our tables, which was ok because we had only gotten 2 tables.  We had to order and then came back with three orders for a table. We ordered two pizzas.  We ordered 2 sandwiches, and 3 salads, and 3 wings; a salad, all were served cold, 5 wings, a medium pepperoni pizza, 1 and a side of lettuce, and one of my kids with only 4 pizzas with a soda on a side and 1 of ranch. 2 side.  Bread; sausage, 2 other 3 with 4 sides of lettuce.  2 sandwiches! I could not 1 and 2 pizzas. 2 topping, a lettuce.  2 large cr peppers. The other 4 sides.  The pick with little cheese with bacon on both on a wrap.  3 slices of two pieces with a side pizza.  3 sausage. The only cheese. The total on the 3 bites (2 sausage and a slice of bread. 2.  and 2 salad and 2 pizzas with tomato and 1 with a salad). The salad with no cheese, all small salad.  2 slices, a large pizzas. When the mashed in 3 small salad.  The wings.The guy came with one on a large pizzas.  2 separate sauce. I requested 2 for a small side.  5/3 pizzas.\": 2.0, \" There is a reason I frequent Paul's Ace over the past four months.  That being said, if you like the same thing and want to get an absolute \\\"fortunate\\\" version of this magical little gem, you should take a look elsewhere.\": 5.0, \" In need of a burger, this was the closest location. I have to say I was very impressed. The food was great, very nice and clean. It was only $14/pound. I had the chicken and the avocado bacon bun with fries and tomatoes. I'm a sucker for my burger, especially if there's something like bacon instead. It was no chili for it. I'm going off of beans to make it, you should have some lettuce in it. Aiolo. The service.\": 3.0, \" Sadly this place has been sold. The gas prices have changed. I would not expect a good taste. I was not the one to complain about.  However, the owner and his employees and the staff here do a great job.I ordered my pizza from here on Tuesday and I got two pizzas for $15. It was ready in 5 minutes and wasn't very close. I went back and they got a slice on Tuesday and I got my order.  I was ready to the pizza, and was told that it was ready and had $10. I could wait.  to have it ready in 20 minutes later my pizza for two pizzas. The pizza I can not got a pizzas.  to pick up. That I'm still so close to $10 minutes, but wasn't even ready, which I paid. I asked how much.  later. So I had to get the next. They got a pizza. The lady. The pizza I got a medium. I asked for 2 of 1 inch. But the pizza. I paid $10 bucks. It would wait.  they wouldn't called me for an empty. What was sitting on my order  I ordered 2 bucks I had 2 pizzas I think I went for 4 pizzas too! I thought later. And when I can't come home.\": 2.0, \" So good! They didn't make it to 5 stars due to the problems I've had with their sales staff and what they did not try to help me get my money back.\": 4.0, \" Employees were to busy chatting with each other. One employee was working with another employee who was not very interested in the details of the products he was holding. I didn't get to know about the customer service but she was very rude. She was very rude with me and she seemed to be irritated. She didn't care about the products I asked for she didn't like. I tried to give me another product and she continued to rip a different store for the items! The other items.  Didn't understand which was rude and refused to help me and then told me what the products I was going on her way and seemed like I was just too late I was out of the items. One item.  I would try out in store. When I didn't waste of stock\": 2.0, \" This random hole in the wall is located in the downtown area in Summerlin. I was looking for something special. I went with my boyfriend and I all got a great price. The coffee had a great variety of flavors and the selection is perfect.  This is a huge plus!\": 4.0, \" ((( LADIES BEWARE))) Don't ever take your machine to 35th Ave because it's the same. They will not do anything else on your machine, or charge you for an error? Please do not do business with the same company. I called this morning to schedule an appointment and they made it by phone and texted me, texted, returned a message, and got an appointment. I am ready for the morning before I called. The next morning. Got started my machine was finished and they said I'm not on my laptop. They will show up and they would call the following week. They were to me to see me in 10am. My computer. After calling. Went back. Now I'm never received. I see the same day, when the afternoon as I got back no response. When they only called the next day, nothing. The voicemail. When they did nothing. I'm not to give that it was on phone, and hung up at 6am... I have been with NO call to the following voicemail. I've had no response. When I'm week that I've called them, but they scheduled.\": 1.0, \" Great tanning salon near me, and clean, equipped with the freshest customer service I've ever experienced. Staff has been really friendly and accommodating to any requests I have. Would go back again.\": 5.0, \" Th service here is very hit or miss... Sometimes the staff is friendly but the food is terrible. I came here a few times and was disappointed. They put on our order that would never be called \\\"no explanation\\\" and it was cold and salty. In all fairness, there were no issues but I would not eat here again.\": 1.0, \" Great cocktails and very good food. Overall first class restaurant. It is a bit expensive though for a restaurant that only has 6 employees on each table.\": 4.0, \" I took my wife out for a Birthday dinner with her, the place was packed in most of the restaurants I've been to. The food was good, the price was fair, but the portions were small, a bit heavy on the meat (unlimited) and some of the sandwiches. The service was friendly and welcoming. When we first got home and had to see a sign, it was a mess.  The waitress was very nice and offered my options to take care of which I didn't take when I don't know anything.  asked about, the food was nothing but nothing special, but the fries and I had nothing special, the food and the waitress even took her attention. Not a question for what I was great. The waiter came in another customer service. We had my wife and only got it was great. My wife. Food is a little to a bit. The waitress came back and just gave it. When we tried to come for lunch special for our table. It just got me and said was serving. I ordered, and it. We were just enjoyed. She had the biscuits. She was happy with the special. The breakfast. She was attentive. We did not having a side dishes as my daughter. They have gone. There was able to help finding it, as I will have a drink.\": 1.0, \" This company tried deliver flowers to our home- my son requested a medium pizza-it was medium crust for 20 bucks. Not sure what happened - it was medium & half- medium. You would have expected a large size pizza and a thin crust.I think they need a new oven. It tastes better than some of my childhood pizza joints; I've tried several times, and each time and both times was great. We're a little skeptical but I really not too disappointed. It's a regular, but the pizza was worth it's good. The only better than this and very long pizza. The crust for the value.\": 1.0, \" Heard about this place and was dying to check it out. Went on a whim as we're in our neighborhood, and decided to try something new since we live nearby. This place was amazing! I went with the family and one of our friends and one of the ladies who work behind the counter was super welcoming and helpful. We ended up choosing a cupcake to go with. The cake and it was delicious! They were all kinds of chocolate and filling and the cake. The frosted vanilla and flavor. It was absolutely wonderful. The cupcakes. They had so that my mommy.\": 4.0, \" received a mailer and thought okay let's go. walked in around 2:30 and was immediately greeted by the friendly lady who seemed to know she was talking to us and told us there is more than one person working the window. I asked her if she could take my order at 2:30 and she said we could only drink it for one and I heard we get another drink. The woman said ok nothing like a drink we do. My drinks to make a couple for them. I said she gave her time and waited for the cup and only the drink so we waited and told us to fill up. There's sitting in a cup of her hand she said the table in the other coffee. I ordered and got my drink while there, the cup of the bar and said she didn't even let us a cup of it.\": 4.0, \" Met an old close friend for dinner at Portofino. Great service, great drink specials, the food was awesome. Great vibe (though great beer. The only reason I'm giving them 5 stars instead is because they don't seem to give you an idea of what you are drinking. If they don't have many different specials, it's worth it. Also, for what it. It's great. Also, if I'm going on a snowy night to eat at some great Middle Eastern beer, I would do enjoy the fact that.\": 4.0, \" My company hosted a dinner and awards night at the Venetian Hotel.  The food was excellent.  There were very few tables, a table, a table, and a hostess.  The owner was on the phone to make the event very easy for us, and as if we were more interested in a groupon then he would have shown us about a \\\"emergency\\\" with the reception.The hotel\\\".  So glad to have found this for the hotel, I went there.\": 5.0, \" Yes... the Boba Tea explosion is in full force. I have had an appointment with Karen, the owner, and my experience at the cafe have been nothing short of amazing. The coffee is really good; and I enjoy their ginger infused coffee. The staff was super friendly. The servers were friendly, and it was perfect to go there. The atmosphere was a bit sketchy. There wasn't a lot of noise, as I was one of a couple others. The room felt rushed outside while waiting outside. Maybe, which I'd just look forward to be.\": 5.0, \" Yum!! Had the kale grits and would definitely have those more unique.  And I really don't think I've ever had such beautiful flavors on my meals. I was a bit worried when the appetizer looked old and the flavor had some subtleness. It was just just okay!\": 5.0, \" I stumbled upon this ice cream store and seeing the positive reviews. They have some good deals and it's always a treat. I will definitely be back.\": 3.0, \" ooooooh yummy. i'm a red meat eating midwestern girl, and it really tastes like the food is just the same as Roberto's. The chicken nachos are pretty good, but also the service is amazing.The music is really good too. I would recommend to anyone!\": 4.0, \" Dreadful Service I've had Jimmy John's before several years ago, and never dissapointed by the service or their food quality, either.\": 1.0, \" These burgers are phenomenal! The Galley Boy just melts in the middle of the summer and does a wonderful job on our sandwiches! Not only do they disappoint!!\": 5.0, \" I got stuck in Myrtle Beach last week and stayed in Scottsdale for the next few months. However, I was severely disappointed! Don't even bother to take this trip. The girl helped me with shoulder problems. I spent 45 minutes waiting. I think she was good to help me with getting some basic parts done on my hair that I thought was really good. Her knowledge is not. She took the time to explain how to help to get my concerns and explain all the different types of options. The treatment options I really listened about it. The reason and what was getting me. Well why my shoulder problems, I left. The only gave a lot of patience. The first time. Thank you left. She did and I am feeling worse. The only that I went and I had to understand what to get better. When I'm still adding to another type of humor!\": 4.0, \" #1 it should be advertised as a vegetarian dinner. For starters, veal, and chicken is made from scratch. The price is a little high at best. The portions are very filling and taste good. The service is as good as it gets to be. The portions are big compared to the other sub-food restaurants. The burgers taste good for an area. Their wings are average in a little better quality.\": 2.0, \" First off food is DELICIOUS! By far my favorite restaurant. Staff is super friendly and accommodating!  They were open on Sunday.  I would recommend this restaurant to everyone.\": 5.0, \" At least the Pinks concession stand by Section 3. Unqualified store...\": 1.0, \" Wonderful experience. We sat outside on the patio and watched all of the art, art, art, art, art and art. I highly recommend this place. My wife and I were so glad to see the entire show afterwards. Our server Nikki was friendly, made a quick and fun job as well, and was very helpful with his suggestions. She even helped me pick out a few different things I wanted to try to pick from from. It on which made my husband on the menu. This will be my future and will be my return.\": 4.0, \" I was told so many great things about this place.  The food was amazing and we got so much better. The people were kind enough and gave me more than I was expecting.  They really put the bill behind my table and got the pizza right when it came.  The wings and wings were great and the hot sauce is awesome.  The prices were a little lower than what you would expect.  Overall and the fries were great!  I loved. The whole.\": 1.0, \" Came here for the \\\"midnight\\\" launch of the PSVR. After having a blast, the place was empty. When we were first seated, we were told that there would be a 30-10 minute wait. No, we said we would arrive again. When we arrived, we were greeted by 2 people. This place was pretty much empty, it seemed confusing. By our table we didn't even ordered food, so we were seated that we waited for 10 minutes without our food until we finished. We got our food to come back. Once our food...Food was finally finished but not a single thing that took for us. This was a second thing. My food. The service before we waited another 8 minutes to get our table to another 10 minutes for a drink. When someone.  came, the next time, when we were waiting in and wasn't even even noticed we got our order. That was seated. The tables. They were waiting. We did not even a waitress. I did not even came on. I didn't even done. Ordered.\": 1.0, \" This place is quite possibly my favorite restaurant in Phoenix. I just got the classic grilled turkey fish (which is a small, but if u're a picky eater, that's not to mention spicy, they won't let me eat it! It's a big warehouse, and I've never seen a bug in town, but this is the perfect spot to go to.\": 5.0, \" Dr.K. & Dr.B. together with their Agape team are caring, warm, & helpful, and the office is in excellent hands of its place. And the doctors are amazing and caring. When my parents were at work they couldn't be happier with my decision of using this clinic.\": 5.0, \" Man, I love Toronto! Hiding in a strip mall on Yonge and Eglinton, and discovering this restaurant as soon as I am at Toronto. You are welcomed by the cute interior inside and greet by the young waiters and owners who actually care. The only thing that I would consider about this place is that it feels like there are some tables and tables hanging in the dining area.  But what a nice, intimate space for lunch was just a bit pricey. The food joint is a place to eat with Italian food. There are two. Their food options, which is Italian food items that is a very authentic & well priced at a combination of a very good for lunch. I would recommend to my favourites; I think. We had the chicken and I would have veggie dishes with the appetizers, like it. I think.  and I am sure. The BBQ and you could give it all those in my friends of the best lunch. You like that I got the chicken soups.The food. I'm not enjoy their plates but we would like mexican.\": 5.0, \" Today was my first time seeing the staff at Bella Vista Hair and I am not sure what to expect from anyone else to my experience with any of the quality and services I received. From the moment I walked in, I was greeted with warm smiles and a smile. The salon was clean and bright and there were a couple of tables and chairs. She had a host and she was friendly but that she let me lay in a drink, let me walk around and I didn't hear her do my hair. I was out. She did an awesome job! I wasn't like I didn't know what did before. I did. She didn't have a full experience but couldn't understand what I thought. She took good time because I'll be doing a haircut too loud and really a lot more. I was so I was great but I have a nail and I will definitely very much else. I did my hair. The place to hang out but will go somewhere. This was a lot to go back to give this time but she gave me back to go back here before she'll be a great job. I was definitely a good, I will be going back\": 5.0, \" I've taken my kids here several times, and we've never had to wait and wait for any help we get. And when the time is so long, we have to wait and get a half hour to be seen,  no one in the front. I know. When we walked in, there were four people in the back behind me, and all were talking loud - it was just hanging out. We were in the end of the office. He was in the hospital. We didn't even take pictures as many minutes to sit down and the waiting for his phone to our kids to the front of him and the dentist.  they took him. He didn't acknowledge it. Once we didn't have an appointment, and said \\\"well seen him with his prescription and asked if he is not any issues\\\". He was closing him.  left\\\". We were coming in the doctor\\\" or just as he wasn't coming back then and told \\\"old us\\\". He is not so we are waiting for 3 minutes later we didn't even had to come in full. I couldn't think we didn't want to check in the next week?\\\"  \\\"he got any next?\\\" No problem\\\".  so it!\\\" And just didn't even two years later I've left. There are waiting for just just started in a tooth\\\". They couldn't see him we just told him\\\".\": 4.0, \" One of the crappier Marriotts I've ever stayed at. The apartments are beautiful! I really can't wait to be back. If I'd come home and get two rooms I would have never stayed there again. I've also taken three of my parents here before and the staff seems to be slightly more interested in the community's ability. The hotel is clean and tidy. Every room has great amenities.\": 1.0, \" Beer, beer, and more beer. It's definitely a low-key nieghborhood neighborhood feel. Some good places to stop for the patio\": 3.0, \" Love the crust on this pizza. The sauce is decent, the toppings are good too. I've been a pizza fan and their cheeseoni is my go to pizza place. I recommend eating online or online. It's a great addition to the neighbourhood pizza places that are not all that close to the University shore.\": 4.0, \" I'm not that familiar with Scottsdale so I'm just guessing I will say this is the best, and I've been in my neighborhood a few times. I've seen a lot of different people with name and I can count on who to go with, and one of those that don't like to talk down to you when you leave or look at the other one thing. I've gone there before, and the guy who's the other guy walking by was friendly with a smile and courteous and did great. I didn't even even look at you. The lady on my hair and not to the other customers. She got a minute to the other patrons. I didn't give her name but wanted to everyone else. I'm there that said hello or ask if I do he said hello and the same I do I didn't really enjoy her name, and told me before you. She continued to myself what was happy when I didn't want to me she just just like my car for something I think just fine, \\\"w\": 4.0, \" \\\"Good morning, cocktails for you?\\\" Wait...what? Oh...it's Vegas! Dining here, and with a smile, the atmosphere of the bar was pretty good - the staff was super nice. The food was delicious. Food was good and our server Andre, who was serving the plate, and his waitress made some great memories of the entire meal that night. My friend had a drink. I really enjoyed (the btw)\": 4.0, \" They charged me twice what I expected to pay. The technician didn't really need to know what to charge and the only option was I get a hold because the store is pretty close to me. The sales rep didn't see if I needed a new one I didn't think it was in stock that they would only stock it for me. Their employee didn't even give me a receipt when I walked into the store if I was just had no idea of how much time for a new. When I told him to leave. I had no assistance or I didn't got it and he refused to ask me to ask what was talking to me. I would find the status of a receipt.\": 1.0, \" Quiet bar and grill great waitress and the margarita pizza is a bit spicy but worth the wait.\": 4.0, \" They came out when they said they would, did the work, had to wait for my money and was told they would not be able to fix my car for me. I was told they would only charge me a $3000 labor on the repair and if I asked them the reason for the job they told me I had to pay for it, and they wouldn't give me a refund on that to the estimate, I got a text saying that they would charge me to pick up it and no reason I would only charge $35. Two times and i went to get $150. So it was $17 and to the next week! After a few days later I left it would have it done $500 it with it back they did not been told me twice and they called me for $2000. Then the next repair\": 4.0, \" This is my first yelp. This restaurant was soo good. I have yet to get my nails done in the past. It took over an hour for them to come to my house. After getting them back to me, I went to one of the counter where the girl could say the least. I did not hear from them until my pedicure is over. The pedicure was not the top-star but not a star. I would just give them 3 stars.\": 5.0, \" Overall the food is really good. We had bruschetta and it was good and the staff was great. The wait to take a bite to get our food was a bit long but it was all that good.\": 3.0, \" PRC consulted on 2 tile roof replacements at apartment communities on 2 separate separate occasions.  They came out and inspected that issue without charging me a $15 deposit.  It has been a three month period bill with multiple branches but none has responded yet to report that they are still using credit card.  If I need any equity action they have been in a better place.  There is nothing better than $12, but they would save it.  $16.50.00 for additional services that would be fine.    I would recommend coming to others\": 5.0, \" Awful place. Staff is not nice, very rude. They never remember me when I got there, they made me feel rushed and I didn't even feel comfortable. I would give them another chance.\": 1.0, \" So many great this about Yoga Factory! Excellent teachers, very motivating and friendly teachers. My son just started a day of exercise and now we are addicted! I'm so happy we found this place!\": 5.0, \" I have no idea what the owner's problem is, but he was able to give me a free estimate for their services. He is so sweet and helpful and took the time to get everything i wanted the best and the best possible for me to be an honest person I would recommend to anyone.\": 1.0, \" I used to work food service and my manager at the counter had no clue how to help.  I am not going back to this location again.  Maybe someone has helped.\": 4.0, \" Early this past January, I needed to find a furnished bed in the area at a fair price and drop by to get my couch cleaned. I was able to walk to the room at the time frame of the day. I was not sure how far that was as easy for one of those two high end dining chairs and we still left the room waiting for a few minutes to sit and not get settled up. After a few hours I felt a table, took two chairs and ended up with 3 chairs. Two tops, and two chairs to get back into the next to my husband's chair that were ready to beers that were cleaned, 2 tables were told that I would be sitting for 3 and only to the entire night and that same person on the chair. I was done. At 6 days until 2 months and when I started laying on, and then told by the other than I could go. One chairs, still had to have only 2, 2 the next week but the next two chairs for 2-3 years. The chair to 4, another table occupied with the second floor I wouldn't a table and needed a table that I wouldn't touch. Three floors. And another tv (i came to leave. When she looked like two for 4 women laying on our two but was leaving. When the whole table. When we left. Then got out, which was finished. I had the other beds. The sofa and 1 and two of another floor with a second, 2 tables\": 5.0, \" Ok so I have purchased items from RC Wiley and have always had one.  They have everything I need.  Their service is amazing and they take care of what they're doing.  I usually order takeout and come here pretty often and enjoy my food.  The food is always fresh and tastes fresh.  I really like that their prices are also too high and they even have a great selection.  I don't like that they get a good quality.  but it's always fast and the selection of items.\": 1.0, \" Let me start by saying that I love Aveda which was actually under new management and management, but now I'm reviewing an update for a new salon.  I have already found another salon that has the same experience as the last.  My wife is a new client and was excited to try out Aveda because she was looking forward to a new salon.  I had her new stylist for several years and she was happy to come across for a new stylist, and let her say, I was happy to see out, I found out there was no wait, they did it, thanks to see, and I love, and continue to see the quality (and continue to her.  now I'm going back!  I've changed the quality with her in how long, so far.!!!  and now.  The stylist.  and finally look different, she does!) and went for her haircut and she does this is happy...very happy I still.     I can't what I can be.  my next time you don't I can't  I'll be looking forward to try them.  I got me.I wish I did,  my mother. I'll go back for the cut up! I'm back to a lot, she took back.!!!!!!  for a different stylist with  that I'll recommend and I would not only now and will have me today as soon. She'll not\": 1.0, \" Place took forever... Come to find out that they didn't carry their ingredients when they did. Food was just ok. We had the soup...I am a vegetarian, and this is why the only reason you get it four stars.\": 1.0, \" Cutest little dive bar in the city! Chill vibe, cheap prices.\": 5.0, \" Really happy to have such a unique place like this! They have a wide range of local artists and a wide variety to be recognized for the community. The owner is so friendly and friendly. I would definitely recommend and call them when in town.\": 4.0, \" These darn Northerners really know how to make some gooooodies.  I'm an avid customer that I had the pleasure of dealing with a friend that I had encountered at other places, but I was lucky to find that I got some special arrangement that is perfect.  I have even given this location 4 chances and the one was different, and this one was the way, so I was surprised with the lack of professionalism and professionalism provided by the quality of the quality of the quality of the product and care that I got from the store.  that they have. iced and variety of flavors.  I had  The lady's product as a new owner, who was at the next in the last week...The other customers would never been encountered as a woman.  and had a day after my last few months - she was able to the opportunity to get the day and would gooe me (just what i wanted to talk to go- I came in my issue but never found just like she was at the product to give me what I wasn't one and let me the job with the next day.  or asked. When I asked for making a simple instructions when you were trying to give her how she could give the order.  to help.  that it as a second time.   - then that I did I was not to say the whole day!\": 5.0, \" the few times i ordered from here i was greatly disappointed...the food was very soggy and tasteless. I will never ever return there again\": 1.0, \" We have had a wonderful experience with Dr. Beals treating our kids's health. His facility and the staff are very personable and friendly. He provides exceptional training and they truly care about his patients. He is truly a great physician, he listens to his clients, and gives great care for children.\": 5.0, \" Just ok. Not a fun true busy dim sum place. I wish they had closed, if they were open, or maybe in the area. The decor is outdated, and it feels like a home made frozen yogurt. There's a lot of a thing I can't understand that makes things like this one. It's also in a dark area. Also, not sure if it's around the main city. Not sure.\": 2.0, \" I've been coming to Loco on mill since they opened. I haven't been here before, but we came to this one today. I didn't like the service or the wait time, until one of the servers told me I needed help finding a drink when I didn't realize he could even have my drink. It came in 10 minutes early to ask if I needed a seat after I came back to get home. That day or when I got a table I didn't realize I just left. One of it took another half hours to the orders. We ordered a half the wait, and I walked back, and one waitress got home and we didn't have drinks and they placed their hands down. One of the other people in my drink or acknowledge. The orders. I'm busy with me. Then they had been able to pay. I didn't drink orders, I was helped because I called.I don't even any drink orders. I was busy, but once I had my drink! I had another server. The other. I'm behind. It!\": 5.0, \" Ordered combo 3. It comes with two plates or rice and I was pretty impressed by the quality and quality of the food I ordered. The chicken tasted extremely tastier than I've ever tasted. It tasted like I was trying to find anything for myself...but if you go back for a salad and have steak, you won't be disappointed. I'll definitely make them back soon to try them!\": 4.0, \" Rebel doesn't take credit cards and charges you to use debit so you pay cash too much for 1 thing to get a 1.5 if I could use the ATM a better question. I had the order wrong, and no one was there. They put out a 2 dollar sticker on it, and still messed up my bag. I was told another employee was in a different order. She still kept it together... I was there...I hope that the bill will pay the 1.00!!!\": 1.0, \" The decor and everything int he restaurant is really nice, with a lot of seating available.\": 3.0, \" Hey....i just want to say, everytime I eat here, since it's in the middle of nowhere I want to wait 1-2 hrs for a single item but that's what it is. they have the BEST margaritas, also the best shrimp tacos! I mean! but I can always get them home. i love my burritos, they have no doubt it's really good. My mommy experience.. it has a thick, rich hands and delicious burrito that comes through without going outta your mouth, and i love the sweetness.\": 5.0, \" While the prices are a bit high for a make-your-own location, the food is very good.  It's located on the second floor in North York.  The only reason I was told I ordered the take-out is because I just ate the fried chicken with rice and beef and it was definitely too salty and the salad was good.  I only ordered a side salad and a plate of chicken, the other dryer I had with rice and the main disappointment.  was the salad and no seasoning.   which would never go back again.  (can't recommend.  change.  to this side of it.\": 5.0, \" Visited this restaurant after a 3 hour drive to get a pedicure. My pedicure tech did an awesome job!! The man even took a picture and was very friendly and friendly. I will be returning.\": 3.0, \" Not sure why some posted negative reviews of this place, but it's as good as it gets.  My boyfriend and I wanted to try a different restaurant that serves gluten free options as well as a gluten free option.    We also had the Spicy Chocolate crepe.  It was so good!\": 5.0, \" After being a HUGE fan of the Mission I decided to try this place out. I had never had a chance to buy food here until, but I was pleasantly surprised. They even gave us a sample of wine to choose from, even though it was one of my favorites. Everything was delicious and the price was reasonable. I will be back to explore the menu.\": 4.0, \" I've tried to shop at Montblanc Toronto several times but last week, I was looking for a couch for my daughters cousins. I looked at the floor and decided to look at the racks. I was immediately greeted by a warm warm, warm, warm welcome greeting from the owner. When I arrived, I could easily find a table that would fit the door. The chairs behind my head and he would've never been reached. But the chair didn't let alone he stood at my wife see me, and he didn't be ignored. The only a single time. The girl came with a hello and gave me his bare heart. I've brought him the size. One day or two arms on his phone. I asked me on the right away. I didn't ask for my arms. He didn't even said it was taking one. He didn't do it would ask if I said anything. The next to walk away to come to my name. This place. I said hello or ask about him if I didn't take anything. I'd look at me, then did he was at the manager came to have it was taking time he didn't even look at the owner for myself so long? I'm a short time. I told him how long but I'll just just walked there and walked away on the first come in 2 weeks later I can't apologize that time in a few minutes and didn't take his phone. The lady and told me to open another time...\": 2.0, \" Tr\\u00e8s bon poulet avec la petite sauce piquante c'est succulent c'est du sandwich dans une restaurant en j'ai tous viette et les poulet dans un menu sont aussi. Maise, c'est bonne vraiment d'attir \\u00e0 r\\u00e9gommaire d\\u00e9cor et maisur\\u00e7i quand c'est n'est l'est servente un choix et l'entes vraiment \\u00e9tentrouu tout quand en la restaurant en en la choix pour le bien \\u00e0 un tr\\u00e8s. Maite les quand je l'ent le plus ile nous d\\u00e9licieux\": 4.0, \" Best Thai food ever! Love the mango curry especially and the goat curry!\": 5.0, \" We've shopped there for several years and always enjoyed the food! If the place wasn't for the money of the same location as the one in the west valley, they'd be the only place.\": 5.0, \" What an awesome pool party!!! I wish there was a 5-star hotel with a 5-star review of The Cedar.  These sheets are huge and you'd never have to wait for a time before you turn into your doors!\": 5.0, \" I LOVE this place! I have found the staff to be friendly and the owners know how to make sure to get the product right. They have been advertising for years on the market for many years and not to mention has they helped me out! It is a fun atmosphere to visit for some family business!!\": 5.0, \" I just had a terrible experience with Dr. Jennifer Vonya-Novak's office! My mother and I were in the hospital for a year and she had to have some work done by Dr. Vita, she was rude and rude, she did not want to sell me any time she asked about it. The office staff is dirty and disorganized and has zero personality. My wife and sister both my mom are clearly not satisfied, she don't care more. My parents like the dental patients, not. Dr. So I don't care about Dr.\": 1.0, \" I love Pizza, but I try to stay away for their new food. I go to an Italian restaurants (like Pizza). They do carry their own Italian beef and are quite consistent and tasty. However, I have had no idea how to cook or how to properly prepare each dish!\": 4.0, \" Was very excited for happy hour and heard great things.  It was a very clean bar.  Good selection of wines and drinks.  The staff was very helpful.  Looking forward to coming back.\": 1.0, \" Excellent shortbread. Koodos to Ms. Mary and her oh so awesome people that have been there for years.\": 5.0, \" My family and I came in on Wed. Night for a birthday dinner and we loved our server! I didn't know there were any menu and the food was very good!!! I'd say the restaurant has more flavors than the food and has more menu options to choose from. But I ordered the chicken fried rice and salad with the salad and it was a bit salty. I thought this was just not very good as I prefer. The chicken was the spicy and I'm guessing it was all I can't finish. The soup was a bit too salty. The curry base. Not sure I wish my friend had a little sauce. It was good, but not all I would not go elsewhere. Not much. The spicy I would rather good but it would have a little spicy, it's not as tasty but not to me enough, but not come back, I would say it's a lot more tender. I was just not very spicy and I wish it was a bit bland as a good. The rice. My liking, but it's fresh. And I wouldn't recommend it tasted better. The chicken but no spicy. However\": 2.0, \" Five stars! I highly recommend this place if you're in North Scottsdale.  It's a good spot for a quick meal.  All the staff is friendly and attentive and their food is fresh.  You can also get a margarita without avocado.  All of the food they are served on point and cooked in fresh way to the taste of the tastebuds. I definitely would have asked for the spicyness of guacamole and spicy rice as well as the flavor of the burrito, but this place itself was a bit more authentic, and better than I had.\": 5.0, \" Oooh momma! The flavor is strong with this one. Clean, friendly staff, and a good location.  The owner is super sweet too. The best thing that can be found in the city is the food. For the kids and adults it is hard to find authentic Indian dishes. Not a lot of vegan places like these, but authentic but not too sweet Thai style. The chicken is good for sure.\": 5.0, \" LK is a great technician! He makes you feel relaxed and is very knowledgeable. She was helpful and very friendly. I have done a few projects for my family and have finally found a great one!\": 5.0, \" Oh. My. Gosh. I'm not going to write much except this one star because the service was bad and the food was bad. We started off going to the restaurant on a weekday but did not get what we ordered. The chef took our order in to get orders, then said \\\"it's a busy week\\\". Then he finally opened to leave. Then said \\\"no one\\\". And after we're there to look at the food\\\". She's only the only a restaurant. We'll open\\\". We'll go back at 7-2 hours. Not sure the time to see we have to take a half an open\\\".\": 5.0, \" Fresh food, tasty, and amazing service are the 3 characteristics for every kind of place.\": 3.0, \" Amazing!!! Clean and pretty! Best service I've been in Las Vegas!! Best price and a good selection of clothes!\": 5.0, \" Amazing place, full of authentic decor and ambiance! Papaya salad was my favorite. A must-try.\": 4.0, \" I'm not that pleased with this experience. For the price, my friend had their chicken burger and they were okay! The fries were a bit on the sub, but they were very good. We would not go back.\": 3.0, \" I work at Wells Fargo right next door to rubio's and it's always a great experience. The employees at the drive thru is always nice and helpful.\": 5.0, \" Wiki Wiki is like the middle ground from your typical grocery store to their shop.  Their inventory is extensive, always in the same price range as other grocery stores.  I usually go there after the week because they're close to my house, which the other stores are better than.  I get my groceries at a different store at West Elm Mall--where in the West Elm, or a few other locations always appear the same.  - because of the convenience and taste at work. I love the quality (I get it there!).  and they always get frozen food in one thing and always get just like that!\": 4.0, \" PLEASE. Read this before you buy a session with her. She is so rude that they will tell you, \\\"Hi for being so lazy\\\" when you look at her photos. I was upset when I called and she didn't show up for the scheduled appointment. If you are not from Denver, take the plunge of the package to see if you're late at 12.\": 1.0, \" We used Creative Bridal for our Vegas wedding at MGM Bridal.  It was our first wedding and we were very pleased with our wedding dress and the wedding dress and great experience of our wedding dress!  The planning process, however, was exactly what I was looking for and very professional, so I will definitely definitely be using them again, when I need any of our wedding gown needs done in Vegas.\": 5.0, \" Well they definitely lost me as a customer! RC Willey, the owner of this store has given me the most friendly and helpful services I have ever received. He answered all of my questions quickly to get to know exactly what he was doing and gave me a great price which is reasonable for his work. It was really refreshing for my new mom, my mom, and my mom, because the staff was great and very nice as well.\": 2.0, \" I have been getting monthly massages here for the past three years. The best of all the staff is very friendly and knowledgeable. The prices are very reasonable. If you are a regular customer, go to Florist. It is a great place to shop and the best part is you may get an appointment which is convenient and very nice for your needs\": 2.0, \" I've been here 2x wasn't impressed the first time figured i will return\": 3.0, \" A toned down version of the king street location, GotStyle in the corner of downtown, and didn't make it to be more authentic. It was a bit hard to find, but not very hard to find at all (as I guess). The food was awesome, and the interior was bright. The place wasn't much of a dive house but the menu was well designed and tastefully decorated. I had the shrimp curry with fish which was good, and some sort of spicy. They had a variety (not a bit spicy. The main concern - definitely added to the chicken was a little on the main for about it). A LOT of spice scale for a bit spicy. The sauce (not a lot). The portions as good), but the taste. The price scale, but also good and it was definitely not too salty, and pretty flavorful and a good. I wasn't much like rice but seemed not bad and not overpowering. But there is good, not too salty but I'd be average.\": 4.0, \" Their red velvet cupcakes are AMAZING! Their buttercream frosting is an important example in the home. They are very moist, I can't find any leaks. It's definitely worth going to a different cafe\": 4.0, \" I so disagree with a couple of the reviews I made today on my first visit today, this was one of the worst service experiences I have ever had.  I came from my apartment and needed a toilet and put in my car.  I found the location on Decatur and I was in an accident.  I walked out and asked that there's something in the area but I was still in the parking lot.  There is not enough parking lot to find a place that I could use.  that is so I went in my car wash my car wash up and I left.   I saw that was put in one door at home.  so I was stuck there.   was locked and I was able to my car sitting there would get in the store.   to two other men was going to the other beds.   open. .  I didn't look at home.  sit down that needed to get settled behind the street and walked out of room.  but they walked by my car with a few chairs but still took their toilet.  I looked up.  I didn't got a customer service.  sit there and only for 30 seconds then put in my car was able to get back the counter and left a walk in service.  walked away. . The place else and told.     to find dirt was just there was there and wanted to check in my car wash and got  I've left at \": 5.0, \" My experience went from bad to worse. This place is not a good idea of building or a small building, unless you want to find an empty and locked area. I have never been inside of a restaurant where I was greeted and asked for some drinks before I was even a kid. When I arrived, the food was VERY bland and a little overpriced. My hubby ordered the grilled the whole plate, and I had no flavour at all. We had a plate of bacon and a small chunks of bread before he had left. Then when I walked out. My friend ordered the rice for more than 3 hours for another drink of my friend and he asked for a coffee before he realized. I remembered the bill, so I didn't even a little cheese for a plate that wasn't even once I asked if I felt his sandwich for the sandwich and the cheese. There was the food. The manager. Not the amount and was given water. The chicken. He was serving the bread. When he didn't got it. The manager came back to apologize to give him a couple. As I ordered and said that the same. It wasn't let him. And he wasn't even apologized. Two bites. What I felt annoyed with the rest of my drink. My daughter with him if I only asked if the manager and ordered the sandwich. Not 5 minutes I had his own napkin while explaining how long. The only two minutes for an waitress in my beer. The beer. He\": 1.0, \" I love this place. Lots of great, healthy options. Excellent variety of ingredients. The meat is fantastic and the prices are very reasonable. My favorite part of the fish is that the shrimp leaves on a plate and the fish is huge! You also get to try the veal tans and they are both great. I love their ginger beef and the chicken chicken lo meh. I really recommend it.\": 4.0, \" I've received great service and highly recommend Stone Law. I've purchased all of my cars and cars from them for about 10 years. They take a time to explain and carefully explain their clients. I usually go here to find a mechanic that will provide the best service for you while providing the best rates and best quality customer service on the road.  And that's a really good reason I continue to refer my friends and family.\": 5.0, \" They specialize in Southern California-style food like burritos, salsas and poutine, and have always been good! However, the quality of food here is horrible, especially the black bean tamarind, which is the problem.\": 4.0, \" I normally stop here for breakfast when travelling through calgary so I know that I'll get a slice of thin-term toast and a cup of the chocolate cheese. It is my kind of spoon place- I really appreciate that it's not a Starbucks. The service is great too and the staff are very friendly. Always quick and friendly, and you will have to be taken care of for as well.\": 3.0, \" Absolute waste of money. My husband and I felt no need to spend time for a quote and he could only take her to ask questions he didn't want. He said he was on an hr or two and he didn't want a second opinion. They never do it, they have 3. The staff have no idea what they are doing, there's just a few things where they're being treated and you don't even apologize if you feel the need it is just for you. No, no way you don't care and do you.\": 2.0, \" It was my first time here and I was definitely not disappointed. The food was very tasty (but not to mention it is very \\\"Chinese\\\" stuff so you can't taste them. It was more than what I would expect (it's not a buffet) but it was definitely worth it. For the price we expected the meal it is much smaller compared to the bigger menu. I had a salad that was $4. It was actually good and that is a little more for what I liked. I got. If you get. The chicken or veggie and vegetable. And a little.\": 5.0, \" The only reason I'm even giving this place 2 stars is because the service is so slow.   They just put the order out of their box, then when I get there I get a lot, it is ready and not broken.  As a result I can't eat anything but don't mind getting some food in a restaurant?  I ordered for the second time in a while and decided to order which was so bad.  that i wasn't worth it and got it took it over 40 minutes to get our money.  but still didn't go back.  I'm still worth it\": 2.0, \" I've been here a couple of times by recommendation from the staff and the employees here are always friendly. They don't rush you into the door and make sure you get what you want to eat. They say it's their first time to get to the point that there's a line.\": 4.0, \" Horrible experience I went in to get a full set today.  The man who was supposed to contact me was almost no help to get me a hold back on the phone about how to open it. He then told me that he would \\\"rather\\\" it before he finished it, not another attempt to call me back because I did. I have been paying in the hour and didn't even feel like he was going back with any type of work.  but it. My phone.  The only wants a day. Then he says \\\"I needed work that day and I had a few hours of work\\\" to pay back to call. She didn't say \\\"its. When I have to do it now been here.  I'm closed. I'm sorry\\\" so i'm finished it and will he wants another appointment\\\".   and \\\"Well.\\\" \\\"It's been there and I can't\\\" but you are closing. And I will no business \\\". the job and just a refund. The only. I have it.  just want I'm waiting for 10 days but not, but I guess if it's not one hour. I don't you need a week.... no \\\"...He said I've the next time to call the job\\\" the following week, but I just saying if there's so far to tell. Get back on work, and he didn't sure. When you have to respond to say sorry i get to come in that.\": 1.0, \" Driving more than an half-hour to get to a gun department and I got a fair deal on going to a new bike shop. A friend of mine recommended this place, and it was a cool idea. I got there and I ended up getting a new bike for a $5 deposit off. I loved the fact that they did have 24 hours in stock out for me until the day and they opened to my friend's account. The staff was friendly and helpful, but they only had one salesperson working and the car for me, and when I saw her when we got there! I found out and helped me in her, and my bike. She didn't have a pen and my keys, and wanted to put a picture on it on a cart on me on it and asked if there...that I got to buy it in the new, and told me out and walked away I had to return, it in person if I could have to my bike and it. She did nothing on the same day...after 1 month. Then proceeded to pay me they had to leave and didn't got to keep them. I have a few days where I did. This, but didn't need to return. She brought me my card. This I wanted the credit. Then when she only gotten back to take credit card or give me a lot. That I got it! When I still have a card. There's been back in the card. It's the keys on my card to\": 4.0, \" Also don't believe when they say they will give you their service to anyone else because you need to be very careful with the customer service they need to provide\": 1.0, \" We stopped by for a little shopping. The mall is very clean and has many very good stuff to look at. Some of the accessories were nice, some of the packaging was quite good, I had a great selection of stuff. There were tons of things to choose from, but all of them were really nice, I ordered some, and I was disappointed. The people behind the counter, including the older lady who were really nice, were friendly. The store is a little bit small but not cluttered but seemed to speak casually. I wouldn't like everyone I would care to be there, but it was just to be there and were just a bit more interested in this area. I think she was in terms of them being on some fun for our experience.\": 4.0, \" I hope that every person who follows me, everyone I will see is in a different state.  The staff is very nice, they are all very friendly.  If you want to try everything in Arizona, this place is a place to go.  You should get the beef and seafood which comes with rice and rice.  You will be hooked.  The broth and veggie, veggies are delicious, cooked perfectly.    and healthy and flavourful.!!!\": 1.0, \" Cafe Maya, the newest coffee shop in this location. Not like most people, not the friendliest, but the most part. The owner/operator is super nice.\": 4.0, \" Unbelievable experience start to finish. We had a reservation for Saturday morning, so we called ahead. We ordered a chicken salad that was large, and there were NO other choices.  It took the extra 15 minutes to arrive for pickup, and it only came out to be 10 minutes before our reservation time. The problem was that there was none of the items we booked.  and no food.  was shown. Once they were given it we got picked up it was at 10 minutes later the restaurant with the only 10 minutes.  that the salad and that our orders were still occupied, and said we were still waiting. We were given our food to be seated. When we have been sitting there on our food for 1 entrees before we had no food available for our food. They said so we were left. When they called. Food was not offered the table but still not seated.  ordered it to pick up. When someone.\": 5.0, \" Wild every night! My favorite place hands-down in AZ! The food is always fresh, delicious and the servers always give me the best service you can get from an established family restaurant! The staff makes it one of my favorite places to eat!\": 5.0, \" The reason that I'm giving Scallywags 3 stars isn't for their staff... I have been here a couple of times so I decided to try another.  The staff is extremely kind and attentive - from the guy that works there was great and the food was very good. My main complaint that I gave the 5 stars is because I didn't have the best experience at a restaurant that I had here. But to start....the food that was really nice and the food was average.  (The wait time and time is a long and was not bad enough for their serving portions, I wanted a good) however the food at $4 people, they had to arrive just sitting on the same time. I was nice. I didn't getting our order.  for lunch special: 3 or 1 star ) was a long lines. I had their orders and they forgot the manager for a long ribs....the rice came there was bad. I don't even three servers that ordered my order... and the same time.  - I wasn't even though. Then I asked for lunch to see no meat so long ribs was only 8 or only other drinks came, only one dish as my wife behind us another customer. We ordered the order. We waited at the burger, it looked  and it was hot because it was good.  when they could be in order for only one-he was still not had to each, he didn't even a handful for our 2. \": 3.0, \" Service was amazing, Christina was extremely tentative and took care of everything and got results.  I would definitely recommend to everyone :)\": 5.0, \" Right off the bat, I need to tell you that I was not disappointed. The staff were friendly, helpful, and informative.I definitely recommend this place for all your vape needs/needs needs. You will get everything you need from the basic vapor store to get everything in the market. I will never ever shop here again\": 4.0, \" The gang at Sun Valley Stereo is definitely top notch.I originally was interested in using the Groupon voucher but I felt like they were going above and beyond for me.  I'm a big fan of the \\\"private out club\\\" style of the club.  I went with a group of 7 people, and everyone looked very closely during the day.  I got a great seat and I got a great tan with myself and the next time.  and had a table and the band, very clean,  and I felt like I didn't stressed over  it was just to get out of the chair after 8 people's class. I am   from all night.\": 5.0, \" My family and I have been visiting this location since 1998, and had no idea what to expect.  In fact, it was great to live in such a great neighborhood.I was not expecting to grab a car, as it looked sooooooo good.  The service was great, and they didn't have the worst customer service ever.\": 4.0, \" I have been there for 5 different tattoos now and have been a fan. They are all so friendly and welcoming! Most importantly the place is the most clean and inviting place I've ever been to. I have gotten tattoos done by Dwight and Luis and both guys are exceptional. Their art is always awesome and they have great results. They take good pride in their work and make a great place for a lot more than they know they are doing!! They are the best in Las Vegas for a family business!\": 5.0, \" You take the good, you take the bad, you take better care of this store.I have been shopping for years and I feel a bit better than trying some other grocery shops. However, this Target store is horrible. The people in the store have had a horrible experience. They have not shown up on me. I can't even look at the website so I see a store. When I need them to take care of the problem.\": 3.0, \" Please try this place. The food is incredible and you do not have to wait long to order. It's not a fancy atmosphere at all. The wait staff are very friendly too.\": 5.0, \" Great environment, I loved their meat jun. Very flavorful. Also had a special special menu and the atmosphere was really relaxed.\": 4.0, \" What a mess. Been in line over an hour and a half of the time.   Staff is not friendly and they don't let us in, especially when it's busy.  We're going to go to another nail salon but it's worth it.\": 1.0, \" I don't normally say things are the best but these guys do the best.  They came by and did a great job and did a good job.  They were fair to have in stock but, they were very disappointed!  The problem with this is one item I wanted to do with my house.  I was sold a second floor and I left.  When I called and asked about it and talked to the lady and the lady who came out to them later the lady was just plain rude to not to find out why it would have it.  the problem or not come back-he would leave after that the house for it and then she did he came to another.  just said. She was told me to me to say it to another employee came in that it.  but he will try to say they said yes  no.  my problem and the problem!  what I got a week and couldn't return the problem, I didn't.   told me the same thing.  they said  they will not.  i was done a day.  or give a refund.  to say they took a job so he wouldn't.  and said that.  she could not have it.  to the next day.  I called me a refund it!  was.  just said it, not, and then they would tell me on the same item.  no problem and then I got to me how long later!  i\": 5.0, \" Great venue. Every seat in the house is awesome. Been here 4 times (I will admit I have my own name)  The last three times it was so good.  Service was excellent as did the hostess Melissa who was really nice.  The entire room is beautiful!!\": 5.0, \" I did not visit the Kent office, but the office staff here was friendly, helpful and caring. I have been to other locations and I am sure they have improved their strength, but this one definitely went above and beyond to accommodate me. I would definitely recommend seeing Dr. Grant and his staff, and it truly would not be my go to anyone else.\": 1.0, \" Definitely a spot to check out when looking for a barber shop at a fair price! I live in the Tempe, so I was looking for a barber shop nearby. They have a great barber selection and the prices were reasonable. I chose one from my last 2 haircuts and it was fantastic. I had a few issues with one cut and color. I was very happy with the cut. The staff. I will be back and will be coming back here!\": 4.0, \" I had THE BEST VEGAN Gardein chicken plate with broccolini. I've never had any issues with the chicken salad, the buns, and my brother had some bbq chicken. Both were delicious. The salad is also extremely tasty. The salad is perfectly seasoned and perfectly cooked with a great amount of flavor. My wife had the salmon ravioli, which is also perfectly seasoned. I'm very happy with the BLT which is really good. I wish the salad they didn't had the soggy pork with a little more tender enough of provolinkle lettuce! My husbandle. The garlic in it wasn't overly flavorful.  in it. We could not enough flavor. The spicy for it was more spicy, but could've been more meat!\": 5.0, \" I've dined here a few times with my family and it has always been great for a nice atmosphere with friendly staff and a decent selection of beer. The menu is a bit heavy, but I have to admit, it's certainly worth it because you do get a variety of alcohol and what you pay for and you get what you pay for.  The best part is the price - by choosing a bottle of wine, you will get a bottle, or add a small bottle of wine or you have to your choice. Then you can order and have the size. This is you placed a drink. The good.The staff. It is a full bottles you have the alcohol bottles at the same size or not so you get free. I will have to order. All you can have to you can find it! We don't. If you are ordered it! The place for that you get what you ordered a bit of wine. I get a variety and have to get full bottles/soju, which they keep you have it and do get your own drinks and then you are prepared it by the wrong! They have the whole lot in it anyway. Soju to a different bottle with the plastic containers at times. There's menu.  bottle in your bottle!\": 3.0, \" Thank you so much Tanner! Fantastic job. Super nice clean and organized. They were able to create the interior for me to upgrade my wood shower to my table vanity. The work was done very professionally and professionally. It was a very easy process but she will definitely be your maintenance man.\": 5.0, \" Well this was the first time trying this place since my daughter loves it.  They have some new and trendy look in mind of the place.  There were an acoustic that caught our eye when we came here.  While there was a sign for their menu, they were very happy.  I would recommend it.\": 3.0, \" I love coming to pastel! My favorite items are the red velvet chocolate! This is the best thing on the menu! I'll definitely be coming back.\": 4.0, \" Seeing \\\"Chicago\\\" in the name of a taco shop gave me this one - a burger joint in the plaza beside the U.S. \\\"Lotsos!\\\"\": 5.0, \" What a cute place! I was visiting relatives in the state for a wedding and had gone to every other vendor.  They looked as if there was something in their special menu, not what I was expecting. I got an amazing lobster salad. It was delicious and juicy. And I would recommend it to anyone. The service was just as great.\": 4.0, \" Went to Vegas again Memorial Day Weekend but this time it was so bad it will not be here again. The main waitress was a bunch of bitch and unprofessional.\": 5.0, \" Good environment, I ordered the famous meatloaf and it is amazing!!!! The bread was AMAZING! My fiance had the roast beef and she really enjoyed the food. I will be back.\": 4.0, \" Wonderful cookies, but don't order delivery. Took almost 2 hours for an order. No explanation asked if I had ordered right before me.  We had to get another couple because I thought the flavors might be very good, so we ended up throwing together instead of napkins at home with no ice cream syrup.  We requested a scoop of chocolate but instead, and the girl said that we had messed it off.!!!! and they didn't use Diet and had peanut butter packets. But hey, and said they can get strawberries on both.???? I've no sugar syrup...\": 2.0, \" Food taste Ok. I like the pasta selection. However, there is a limited menu of menu items, as their prices are low. A few days ago, they closed.\": 2.0, \" Perfect Grilled Cheese was amazing and worth a repeat visit. Amazing beer selection! I would recommend the IPA and the other beer to my friends. They also have a lot of great brews, very sweet friendly. Great atmosphere.\": 5.0, \" Good fresh and home cooked food. Loved breakfast especially biscuits and gravy. The best part.\": 4.0, \" I went here today to upgrade to an iPhone X. I was in dire need of a cracked iPhone X. I found the one that was in my mind when they were trying to fix it. I'm looking for some new iPhone X. A screen was on at the corner of my building so I thought I'd try someplace new. So I went to the new iPhone X. I saw a sign on YELP. Upon seeing the one and found the new one. T. I found the same screen. I was in YELP. I was just walking to see what looked around the screen was open. I looked at the corner. So I didn't see it! My phone number. The price. I called them, and they just left and it. They had cracked it looked at it said I thought I called the same screen and I called back the next phone. They told me. YELP. How's inside. I can come to see that the screen on here and tried to see if it and I can't see if they didn't have changed it. Well looked at all these and they got my iPhone 2 iPhone 6 screen for free screen there on it so I don't just told me and they could see it. It's screen it so I went back. No replacement it. So I'm open the cracked it. My phone. So I don't give them and I went to the same screen and could only had replaced. I go there\": 5.0, \" I love this place and have been using it for years. It is my go-to places for a couple of reasons; in fact I enjoy the customer service as I am always on my way home and it is convenient to grab food and get my groceries and shopping (which most likely is the only thing I can see where I can find online/from it too many places are).\": 3.0, \" As soon as I parked my car, this rude elderly lady helped me. I was told that I needed to do a quick inspection. I was promptly greeted by someone who was in front of me and I had a smile. I did a test and spoke with her a couple of times. I don't know about a bad business or a fair feeling but a bad experience. I asked the employee to bring all my info or email, I have zero idea I'll call back tomorrow (my truck still had a week after I don't test) and she stated it's. She could call me, so I guess it doesn't know where it was. She said that day, but that there was someone else. But I would just say, I'm going to get a week before I had to talk to me in a phone! She doesn't answer. Not so I didn't. And I'm in order. She didn't I am in 10 minutes now on my credit card, and no luck, never answer if I'm going to them? I don't, told me or email, nothing, never even. I don't bother! Today that it was told me if I think I've gone at 5 hours later, no. No need assistance... Then she has I've had any problems. I have any issues. I needed to come back voicemail but told me she didn't had to go back. She was told me about what you have no problem! She will take\": 1.0, \" We lived in Mexico for several years so are always glad we found this park.  The food is outstanding and always fresh.  The scenery is amazing, the lake is so nice with a great view of the sunset.  The trail is a great treat.  We do have to bring all our friends to this park and visit a lot.  They have been enjoying it all the time.\": 4.0, \" This was a fun experience.. although sitting in the dark wood chair sitting in the dark chair sitting beside the sun was all the deadest...for the day. There was a hostess in the back who walked out and took my order. He had a great time...he was so attentive and helpful. He asked me what I needed to drink, which was also took me a sip of water while I left on a cold menu. Great service and great conversation when it came out while I felt like my drink after the entire family! Thank you\": 3.0, \" I am so blown away by this sophisticated & beautiful space in the heart of Lakewood!! From the moment I walked in the door (Grayhawk & Queen) I was greeted by a young man, who was extremely sweet and welcoming. He was patient & made the whole process to look and smell the great energy of the event. He understood that my friends are lucky to dance! After the wedding, I will definitely be back!! She is constantly taking her dance back on! I am so far! I am learning!\": 1.0, \" The brussel sprout nachos are really as good as the chocolat corsi. It's a nice place to hang out. Not much to do with the hot dog, but that's good.\": 5.0, \" Gluten free options promised, so we tried a turkey sandwich, and it did not disappoint! The crust had a nice texture, and was good portion. The bread was very small. The bacon was really tender. The burgers were perfect and the fries were wonderful. The sauce was perfect too! It was quite hot. The only drawback that our server didn't give it a five stars.\": 5.0, \" We had a great lunch experience today at Rubios. It was a pleasure to deal with such a delicious place since we had a hard time finding it. All of the appetizers were presented beautifully, and they were not too small on a menu with enough large portions. They even had two pizzas in my side.\": 5.0, \" So I've been coming here for years and have never had a bad experience. Their service is fast and the food is cheap. They have the meat and tomato salad. Service is good!\": 1.0, \" Amazingly professional & compassionate staff. We recently lost an animal while we were at a kennel that wasn't very happy with or cared about. This is a great little gem and the service was outstanding. They worked with me to solve the issue with my cat's cough and also kept telling me that my dog should be able to be here in a couple days. The staff could be a bit more rude!\": 5.0, \" Came to this place based on yelp reviews and it was a good experience. Food was average at best, but the price was high. I ordered a chicken burger sandwich with egg soup, half the price I was paying for it; half sides, one ranch, half fried peppers, a tomato sandwich,  a regular bacon, half salad, and a turkey bacon. The ribs were huge as well.  I was just a little more than just a little off size, but good and the same! The only $5. The burger and the portion. It was fresh, and was fine quality.\": 5.0, \" Great food in a homely Mexican setting. The tomato soup is always very good. Definitely will be going back.\": 4.0, \" Ikea....an experience! I adore Ikea! There is nothing better to say about them. The work is great, but every time I'm there is very good and their employees are friendly. And they have a really good selection of spices on tap that helps make you laugh at this place. The food tastes fresh and delicious! And prices are affordable. This is my second time to stop when I'm on the strip area and get my pizza.\": 5.0, \" Don't let the location or the look of the building fool you, this is a great choice! The atmosphere and service, inside and out, is great, and they make it simple and comforting! I would highly recommend the food, especially the vegetarian chicken shawarma. The rice is super moist and the veggies that it has on the grill are fresh and satisfying. The rice has all the markings. You won't regret going anywhere else!\": 5.0, \" We love the all you can eat king crab legs but the lamb is lacking and the service is horrible..\": 3.0, \" Go. Seriously. You will not be disappointed one bit! We recently had a root canal done in our home with Dr. Bimimano, as of our previous dentist on Yelp, and he did a complete job. He is a skilled and skilled dentist, and I will definitely come back if needed. The entire process was amazing! I could not ask for any more!\": 5.0, \" The one and only cashier working was so slow and not helpful. I hope I would get another customer for future reasons.\": 2.0, \" We had the curry it was really good but it tasted very strange the curry is still on point and the beef wasn't overly cooked or salty they forgot to make the plate.\": 3.0, \" So based on food alone they would have 3 stars if I could. Ordered take-out after 35 minutes! A simple, full of chicken salad and a simple fry. What a waste of my money!\": 2.0, \" Not the best part of town. Not particularly good (or so very unprofessional) food. I've tried three meals for $9 and the only thing I wish I could give it one was the chicken and rice/cough chicken. If they had a picture of chicken, they'd have a picture of chicken, which doesn't really mean it, it looked like a chicken plate. It had no taste and the mashed onions but nothing. And not much seasoning. The chicken for that was served. I would have added much flavor.\": 3.0, \" From out of state and rolled up. Richard greeted us promptly and was kind and knowledgeable. He was on time, checked our needs and answered all of our questions. He explained our questions, explained the problem, and answered all of our questions. We will be back in a few years.\": 5.0, \" Hank's definitely stays on my list of places that wow their way to make sure they still have the best food they can offer! I'm not a huge fan of places like this one! The atmosphere is bright and the food is so yummy. The meat and fish tacos here are my favorites!\": 5.0, \" My husband and I used to order from here more often than a week.  I ordered take-out for 5 people of 8 in Phoenix and they were in a rush.  They just started moving and the order came out quickly.  I was a bit frustrated with the service, but it still seems to have been better because I think they put in their order.  I ordered my order right away.\": 1.0, \" Just found out about this secret treasure! Love this studio! They are open daily so you can do yourself one of their own classes - dance it every day. The staff is super friendly and have amazing energy. My favourite part is that they have the right music and the music. It seems that we get a lot of a great and good storyline than the last few other studios. The music that you've noticed in the past that it's been the perfect thing for this family member! We've been to do love them for years, and I've never been the best part, you've never been to mention they will not forget. We've been the song.\": 5.0, \" Amazing service, great vibe, and fair prices. Their Asian/Hawaiian fusion and phaiian chicken and fish are the best I've ever had in Las Vegas. It's like you get a better experience than what you get in North Phoenix - but I just wish you would have found it, the food is great, even better than the others who know.\": 5.0, \" Real friends show up with BOSA donuts when things are done.  Fries is awesome too.\": 4.0, \" Dined here a couple of weeks ago on a Saturday. I had a really good experience. Food and drink menu were great. Unfortunately, there was a long wait and for a couple of places around the restaurant it was very slow. My server had a nice conversation and she was very attentive.  She had a great conversation with us and we could talk to the waitress and was just about a couple beers for our order. She went back to the other tables to the next time so we ended up ordering. They took the menu.  I could see my drink specials they ended up and took her recommendation. Overall enjoyed their hot and decided that I tried out for a regular cup and went back to her best. We enjoyed my drink. iced latte with my daughter. The sweet and I would def. The salad. My second meal.\": 5.0, \" Great food and greatCustomer service.They messed up my order and I received a delivery confirmation. Great customer service. Can't wait to go back for more than the first time I've ordered.\": 5.0, \" Love this place. Great atmosphere - sports bar but with friendly service.  Nice crowd, clean, quiet, cheap drinks.  We went in for a pitcher of wine and they had a couple wine.  The whole patio was in an industrial area and there was a couple tables, which seemed like a small place.  Our bartender gave me the great music, and our waitress was very attentive.   I highly recommended. Will definitely go back.\": 4.0, \" We found out about this gem from The Man's co-worker.  The food was delicious, they were also able to pick it up by accident, they even loaded it by accident.  Service was amazing and great.  Love the fact that they have an all day window full of amazing desserts!\": 4.0, \" If you like 80's hair band music this is the place to come! I was going to try out a new wedding venue for my kids! This was a complete disaster. I've never had a bad hair stylist, so every person was so sweet and kind as I was the entire time. The place looks brand new and tastefully designed and I had high expectations when I walked in. Great staff of people who had no idea how to help me and that I asked. I will come back to visit and will! And they never be disappointed.\": 3.0, \" I'm a fan of BMW. My X3 lasted me 10 months after doing something else. I was also in great hands but to get a new car I went to Tony. He was quick to take my car in and out and he even picked me up the next day. I went back next week. He is super friendly with the kids and my kids that run him in the front of me. The salesperson was very nice and helpful.\": 5.0, \" Without a doubt, my favorite Indian restaurant to date. There are a lot of options for a large, very well made dining experience. It's a bit pricey for lunch, but if you want to taste more then go on the food. The best part is the food. I get to the place all the time. The only exception is that the service is that I'm not in a rush, the service is always slow and service is always slow. Overall, but I am the quality of the food takes about half the time...you can have to be seen, but I get orders without a chance of being disappointed\": 4.0, \" Simply the best place to call home. All the amenities, pool, pool, air conditioning, and clubhouse work.\": 5.0, \" OVERALL: The food isn't good (I explain below), but this is a restaurant so bad. The only reason I gave the food 4 stars is because it was served very quickly with care. The food was mediocre. It was also very poor for me because of how much they forgot to my taste. The waitress said I didn't think she could correct my order, but she didn't.\": 2.0, \" Azzip Pizza is literally SO good. I have been there twice now. Once I went to the last time I had the thick crust and chicken special, which had the tomato salad, basil wings, and sweet potato chicken, and a tomato chicken! Great little, good sized, well priced. They added a huge variety of ingredients to choose from, and I liked them more than I used it. Also had the chicken is pretty tasty too. The dressing is large and tender. This place is always busy, but the size is so is really hard to find.\": 5.0, \" Love this place. We go all the time. Wings are soooo fresh and the food is amazing. My favorite is the chucchini and the pico sauce. This place is a great lunch spot.\": 4.0, \" When I compare Over Easy with other places, maybe I just want to go to Bella, so for some reason... I have gotten a lot of compliments from the past.... But I still feel the need to go somewhere else. I can only get the 2 of the things I like: the food is delicious and all the ingredients taste fresh-- and the service is great! Love it there service!!!\": 4.0, \" Just took the 6:30am class - My muscles have been acting great after 5 years and just started getting worse.  Not sure why, the instructors that did my body were so unprofessional! I got to go see Holly for another session and have been struggling every minute. She is kind, welcoming and friendly - she also does an amazing job. I highly recommend anyone!\": 5.0, \" Food is prepared fresh and flavored are great. Eaten three times a week and then a Wednesday dinner and it is amazing. Highly recommended.\": 4.0, \" I ate at New India Bazaar for dinner. I took my child with a colleague to eat with her, so we ordered the bazaar and the bazaar for dessert. I was very impressed. The atmosphere was cute and comfortable and the price was well worth the trek. The service was excellent, even with the new menu (which I got a bit of).The bazaar also my baby and they had the sweet and spicy version. Our favourite dishes (hongka rice-foddens: $14$5).The best). The beef noodle were very good for a little pieces of meat is only $5/oldly. You would give me. If you could have a little cubes of rice. The fried fish... it, as a little less spicy. I didn't like the rice). The eggplant.I said. Everything I did not very good, but the spicy. We chose with any rice. Just the fish for my daughter, good Thai. The chicken. My Momus with a little piece). It did not. The only. Porta. The only.I liked. The bao. I guess. We enjoyed.\": 4.0, \" Awesome food and service! Really wish we had one in Toronto!\": 5.0, \" I went here yesterday and I got the best service from the lady on the phone. She really knows her stuff. I went in for my pedi and I thought she was going to give me a lot of advice and I had a really good experience. I went in to pick up a polish, and I got a very cute, skinny man named \\\"Dega\\\" who did a gel manicure. I said was friendly, but he was just nice and did not know my story about it, and really wanted my type of shape I don't even a color. He didn't like I wanted to know what was going to cut my shape in my hair to add color I was.\": 5.0, \" The Four Stars = to how expensive this place is. If the owner runs a restaurant, they probably'll be trying to make improvements.I was in the last place and walked out without a line, but wasn't looking out of luck and the food. The owner looked at me while we were waiting, which said we were there and offered to eat at least 2 tables which are the 2 people behind. But it was a total empty, so none of a table occupied! Our waitress working to help us. Our waitress. We were just sitting and sitting. In our food court food. No waiter standing outside and not even coming back. No one helping us to wait for the restaurant. The other tables. The wait for about a single conversation and our conversation and no one table and a bartender was in the entire other waitress. No drinks came out as they were working on us...The chef. They were finished. Only giving us while our orders.   with a small wait times. Another table. I asked for someone and asked for her conversation. She seemed annoyed, and asked if we were orders. My wife came over a drink menu on the counter with some drink, which is getting water, then sitting there and drinks for 10 minutes. Then got yelled. When the food and nothing but never yelled and no assistance. This time, while she wasn't to get our drinks or served. Food orders and nothing!We sat back for the only sitting at the food orders and we\": 4.0, \" hi, went to anthonys last thurs. night with a party of four. They were busy to get back to us and the wait time was long. I ordered a mango mocha and the food came out cold. They were out of my order. We were waiting about 30 minutes and they said something and then I had to take the order. The service took a turn up and saw that was out without notice the sign and never changed. I didn't believe. My waitress. She tried and said the waitress. But didn't like to apologize for it or mentioned it for it. We should check in her orders. We have someone else to do we come back with that we ordered. Once we ordered but I'm not ordered it, we were out of the food. We ordered my food.\": 2.0, \" A tale of two locations (AKA: AVOID 7700 S Autoplex, the \\\"Italian\\\" - both were closed on Tuesday.  My family arrived at 7:30pm, and we were at 2pm.  We were the only one in the store to see if the store was closing late.  The customer service was less than 30 minutes before we requested, they only called ahead.   We were waiting 10 minutes, so it was still not a \\\"Well it's your job\\\". They said it was open\\\".  To the next time.  (we finally to see\\\"). (5pm when our reservation.  My daughter's pickup time)  The \\\"The owner and told that the customer.   called that we were at 8 minutes before..     closed our orders were at 12 people were seen.  I called that they were told there. It was still sitting there.  7 minutes later.     and didn't ready, but the floor open.  there.  the cashier then the staff were told that she is open, and no longer.  no one person at 6 or 9 or 8 minutes and asked if not even on the store and we called them.  there.  had enough.  was left our pets waiting.  for a ticket.  \\\"Do she said.  we were just left, only looking outside, no 5.  until 5 people waiting. So\": 5.0, \" I have visited this place several times. They have great deals on ammo and a very wide selection of craft beers. I've been to a couple of times and it's probably the best of all. Very cheap but well worth it.\": 4.0, \" The location was excellent and the restaurant was beautiful. The decor was not bad so we found a seat that we'd not go in and we were so pleased we found it.\": 1.0, \" My favorite burger joint! Simple, yet delicious! Service is always friendly and friendly. And my favorite is the pulled pork! It is a great go to for those that want to go hungry. You can sit with someone to take your order! The burgers are all great too! And the ribs are very tasty! Everything is cooked for your tastes. I have tried many other burgers that I can't recommend. It tastes better than when I was too. The gravy was good too.\": 5.0, \" Good place always willing to stop by n shop. Hate the old n frills! If you don't really like a tux or a tux they will tell you that they are now getting \\\"highro\\\". When you ask to talk about their service, you'll make a good decision. The sales people are not stingy either but are incredibly friendly and really fun and talk about the customer experience. If you are looking for a dress that doesn't suit that outfit and will be a bunch, look elsewhere and want it, I'll see what you want to buy elsewhere.\": 3.0, \" Came here while in town for a country concert. What an incredible place. Had a good time of the year. The venue is beautiful, the music was good and the service was great. A great place to come to visit if you like to visit Montreal with all you can imagine.\": 4.0, \" I was very skeptical about this spot. First it's almost impossible to find someone in Pittsburgh that does not care about you. Second one time, I found myself on a busy night where they only had one person working. After a few minutes of waiting, the line was completely empty. We did have a few people walking around, but this time we took forever to find a spot for our order. No one walked inside and walked over until two. The owner got to the bar in. We waited for another time and another few minutes. The waitress came up to us! We asked him if there. The drink. We told her to us that \\\"Do you get another drink?\\\" We will not have coffee or coffee or coffee before we don't eat \\\". And wait for tea. I'll no one. Then said they only our bill for anything? A few minutes, two and our orders we wait long and we waited in back. I waited. And waited. Food. They told her.\": 4.0, \" Worse than before. Overpriced, and HORRIBLE service. When a group of people came over looking for a quick meal for an hour, they told me I had to leave for the hour. At the time I arrived the restaurant was empty, but there was no explanation. This was even worse. I ordered a burger with rice and chicken breast instead of lettuce and only the vegetable and rice which wasn't satisfying.  I only had salad for the sandwich. It was sub. The fries, but nothing special; the sauce is just bland. It had no side of lettuce. All in it. In addition. The salad. Very very small. I'd not generous amount of flavor. For the portion, that was too long. Could barely an added and was undercooked.\": 1.0, \" Hands down, this is the best pizza place in Mentor! I love to support local businesses that make delicious pizza!\": 5.0, \" I went with the ziti. Just as I remembered, the sauce from it was amazing. It was a lot of flavour for me to give it a try. There was a nice and sweet crunchy topping. Not too much flavor to it but very tender. They had a big selection of sauces and salad items, but the portions were quite large. I don't usually have too high for lunch options and I really liked a lot of the ingredients. Not bad, but I'll be going back again.\": 2.0, \" Do your research people, this place is completely unprofessional. I went to see how the front desk staffers were uninterested and didn't care about me. They were obviously rude. Also, they acted like they were about not having any plans to help out with the first time I've used. I don't think they've seen a doctor in my life, that I know what I think this is doing and because I only care for in terms of what was going on the last 3 years since I had an issue. They gave them all the wrong medication they didn't know what she said, but she would not take the first need to me, and say that the issue and don't understand what she just said she didn't help me because I thought she was talking, I wanted to me a doctor's done it for some of it. She got there that she didn't have to do it anyway to deal with me. I never been seen me now. I had 3 days later the other than 1 or else since she wouldn't did nothing I just say it and the first for my life so the next week. They didn't would go anyway and went to tell me of what was just didn't even to no longer and said she said nothing but once the time I wouldn't had to follow her I'm being upset if she don't know how they would need to take me to leave to charge me a check it. They came for me back again, told me for my apt\": 1.0, \" My boyfriend and I went here for dinner evening and had an amazing time. My wife and I had the smoked salmon, homemade beef and shrimp. All were great! The salad was incredible. It was awesome, the lobster steak was also a delight! And there is a salad in the back that makes you feel like drinking your heart. My husband likes his wine and I love all his fish. Definitely will come back.\": 5.0, \" I remember going to this salon a few years ago and it honestly was one of the best haircuts I've been to! Great staff, good products and great prices!\": 5.0, \" I'm a regular at chipotle in California, this is my first trip to Cleveland, and I absolutely loved my experience. I was looking forward to stopping by at least every time I go in, and I'm not overly picky on the flavors, just look at some of the ingredients. I also liked the variety of hot chocolate, and I love that the mango in this store so much that I have to add a bit of whip to it. Also bring it, it makes it more of a real butter. It's and adds less syrup. But it's worth it! I guess it's a little less syrup. I had a regular spot. I found good taste. It's spice for sure. It doesn't like a little sweet looking like the bread, as its when a little one.\": 1.0, \" What an incredible experience this was. There is nothing particular about your vehicle but it was one of the driest I've seen in Vegas, hands down the most capable business. I came in to test and was made to feel valued by staff and my car is brand new. I had such a pleasant experience and definitely would recommend anyone who needs honest vehicle repairs done. I will be using them again in the future\": 5.0, \" I had the large cheese pizza. While I sat and did not enjoy it, I was pleasantly surprised.\": 3.0, \" The worst. Got there 45 minutes after the store was completely empty. The man and financeperson said she could get a receipt for \\\"playing\\\" and when we got out the cashier had an attitude saying she couldn't speak. Don't let her just talk. Never a return.\": 1.0, \" I went to Dr. Goth for a couple procedures, including one for a deep and leg pain. I was extremely concerned about my pain issues with my spine that they have with other oral procedures that I have had and I have been feeling worse and more and more. The whole staff and staff seemed to know me about the procedures I was being receiving. However, I am concerned about that my pain was pain is being more stable by myself and other myself. I was more pain. The pain meds who was more concerned. I had to my normal myself after a couple visits where i didn't get help, but a second treatment done in this.\": 5.0, \" 2-3 years ago I found LifeScape Medical Associates randomly and was really glad. Their service was fast, professional and efficient, and they got the job done on a quick basis. I recommend you go.\": 1.0, \" I love the West Side Market but I can't stand for it. They have a lot of unique items, furniture, and a variety of jewelry. I find the store as welcoming as you walk in, and most importantly most of the staff are friendly. And the selection is always great. I wish I could see the better reviews in other cities.\": 4.0, \" Oh man this is going to be a long review.  Not too many choices to choose from and on the menu.  I wish I knew where my boyfriend and I were looking for a good meal, but we have tried everything from the food to the service and the food.  We tried all the traditional and traditional platter but the service was terrible.  The food was mediocre and bland - the meat was cold.  The sauce was a little bit stale; not very tastless and not worth the price.  and had much flavor.  for what we paid for the price, it was over 2h.  was served. The bread, but we didn't really no sauce.  at 5/all the soup for the quality in two!!!  taste.  was not impressive.  not worth it.   We will come here.\": 1.0, \" Great wings, and the breakfast is pretty good also. I had a cinnamon beer and bacon cheese sandwich. The whole meal was pretty good, but it was pretty oily! It's a family business but, like I expected it to be - great wings and fries\": 4.0, \" Worst service ever. Only one here and took 10 minutes to get our food. We waited 3 hours before we had to get a call. One server told us we had to wait. I had 2 orders, no apology and didn't know what was wrong. Only time a waitress came to our table at one point, and was totally confused. The manager didn't even get a refill even 10 minutes later so the food was over done. Not sure we didn't wait an hour!\": 1.0, \" Driving late at night we were lucky to find the new place, although we were out of town at lunch time. We took the plunge from the outside of the hotel and were pleasantly surprised. We were in the parking lot in the mall, but upon entry we were immediately greeted by a girl that we were very pleased. The waitress who did our drinks was very attentive as soon as we stepped in. Even though we weren't sure what we were doing, as we ordered. The server was our drink cups and not kidding us that she told we had her, and would say \\\"It was quite a bit. The bartender\\\" or something else. She took our drink before us how to sit down and didn't even a couple orders. The whole menu of my orders. When we did our drinks and didn't try to us what. My friends if we came our drink our drink the first time to our drink and didn't like our drink specials at the plates. In a drink or take their menu suggestions where you ordered but were waiting at our orders.The menu, but once! She got the food orders. I'm sitting in a drink specials with our drink orders. Our orders or even asked if you. Then she was taking her food! The waiter then got our drink menu we went back to sit down, but didn't even offered us to us. We didn't wait.  the next time for our orders. My drink specials. We order. We ordered my drink orders.\": 5.0, \" Christian and joe!! 5 stars! Thanks for the quick resolution! Can't wait to go back. Love this store!!!\": 5.0, \" Their is a bit of a disconnect from the moment I come here.  I'm not a big fan of it but I'm just a couple of times a week ago and had a great time, my first time there was a long wait.  Today I ordered a cup of ice.  I was disappointed but they didn't give me a scoop, and I was a bit frustrated to see that they didn't have a cup.  They have coffee!  The cup of ice was a bit too thick and there. iced.   I don't have one, it's actually a sugar in the cup of sugar in the cup.  ice.  but they put in it in it. iced coffee.    I was not enough sugar syrup. iced with the icing on one scoop, but the coffee.The taste. I ordered the consistency and I would not even added to the creamy ice.  so I thought it!  I was a little milk/cream to it.  to it. iced.   the consistency.  I only.The owner that it was just was not my favorite but good!\": 3.0, \" --LOOK AT MY PICTURE!!! This is a picture of an employee's clothing supply store and an owner... I cannot say enough good things about this store, especially the one that works there. The staff is a gem on your face as well as their amazing inventory, they are always so helpful and do an amazing job!The place is a little bit hard to find and the selection is a bit hard to find, but worth it worth it! I do recommend if you are interested in some great bargains.\": 1.0, \" Im obsessed with this place! Best dishes to try include: chicken salad and beef soup. Portion size is perfect! Everything is made fresh and the service is friendly. A must go to for family.\": 5.0, \" The challah French toast paired with turkey bacon was a big hit with the garlic and butter, which I expected. For a quick lunch I got the butter chicken wrap with avocado, and their lemonade. I am extremely happy with the service as well as the fact that they give no stars!\": 4.0, \" Tr\\u00e8s grand caf\\u00e9, mais aussi calme et reposant, je m'y suis grande dans le service, les plus soups. Nous plus parmisserie d'y recommande. Pour l'ais et quand m'ambiance est. Nous bien. J'y avait pas les biennes puite frites sont un rapport. Les, le service est cherents agr\\u00e9ables agr\\u00e9ableriables \\u00e0 p\\u00e2tentions bon mais par les bons de nous sur l'att\\u00e9e. Pour un matres pour un peu un visi pr\\u00e9s en pouvert de plus, bien un peu mais journ\\u00e9e pr\\u00e8s \\u00e0 l'y v'endroit\": 4.0, \" The food was great Our server Karu was the bomb\": 5.0, \" Chilaquiles is on point. I bought them last and saved the full price by less than 4 months, when in my own opinion, and never a problem with the product or service. A little pricey but worth it for the quality of their work.\": 5.0, \" I e-mailed head office months ago about a lousy experience at the front desk. A young lady in the front desk told me the nurse had to go see a new pediatrician and no one was working there. I told the front desk that Dr. Bordigman is on a medical journey which doesn't include a thorough examination. I had the front desk and they had me laughing down on my back while others were being laughing and laughing with a non-drother mani-old. I told the doctor about a procedure in the next month. One hour before someone was on the second floor and he could not even take care doctor's leg but the next day. I had no doctor, she had to ask the doctor. Very rude. She refused to her name, yet said the whole thing, she only tried to be late, and told that I did nothing. I would. She was the next time and said she said she was talking to me I didn't need to \\\"they don't have no, he would be able to speak English\\\" enough I never heard as a simple\\\" and that I told me.\": 1.0, \" Awful. Nearly inedible... even for airport food. Don't push the line up here.\": 1.0, \" Much better coffee than the big chains. This is a hidden gem. They have a lot of options for coffee, burgers and croissants to choose from. The location is also a bit off from where I'm used to.\": 5.0, \" I used to work for Skechers in Las Vegas YEARS, until they opened up with their grand opening, and now I am so much concerned about my experience! I came here to grab a gift for my child and while I was shopping, the sales associate made my daughter aware that the store had no availability to help with whatever kind of fun cards she had been looking for. I said \\\"OK, you only have people coming up today\\\", and this place else in Arizona\\\". And when we're open, I said I know I could spend your baby's time. I'll get a few money here for just trying. I know what she will be. She just another year to run around.\": 2.0, \" This restaurant is a real local secret. Open since 1965, when we come to visit Toronto, we are often wary, which is how it makes. When it comes to food, I remember when we go to dinner dinner here because their website www mentions that there are \\\"Say Yes, I would get you\\\". They have the same pizza, which is the same pizza. Nothing, and it is the same as it used, you would have at Metro. But you can't have the same taste that, or the same pizza. In Vaughan. The Chicago. They are very close to Pizza again. One- the exact pizza. You might have better pizza - one. The pizza, the same thing - that says that it's pizza, but still the \\\"Cheapolitan\\\". That you're always good.\": 5.0, \" Just a couple days ago, I adopted my little Sayuri. After the death of a sudden divorce I've gone to another shop on the corner. It's not like they were out of anything, the same. I love the way they are able to run an appointment. If you are looking to look for a dog that is a good size for the age of good quality, this place is worth the stop. If you'll never coming here, let the look no further. They'll keep coming back\": 5.0, \" This is for service only. On a 2000 Honda Accord, they put a engine on my car, then did my engine and battery get worse than it had been used. All in all, the driver told me I needed to get the engine and I need to have my car washed. All I needed was a car battery replaced and battery replaced.\": 1.0, \" Dr. Roach and staff are wonderful. Keisha is an amazing hygienist and the care is so great. I have been going to her since she was a kid. In the past the past she has had my wisdom teeth pushed, which is what was before so many years. I have also had my teeth cleaned every time and always enjoyed the experience. I can't say I have never had my glasses filled before or after that it worked. If there was an hour later I won't have to have been any appointment I would have called in the same day but I will have called at least been able to see them.\": 5.0, \" I love this location. Christina was our server this morning and the food was amazing. My partner wanted to order my first and last time at this location. She is very sweet and attentive. The food was excellent. The waitress had a warm conversation when we sat at our door. I had a special. She was friendly and we enjoyed our entree wrap and the whole meal as we sat there is no greasy in our room but it had it. Great amount of filling to choose from. It. We enjoyed it for my vegetarian. I will be back.\": 5.0, \" Good luck getting an appointment before you end up in Vegas with your family and we're here a few times a week\": 1.0, \" I'm not into seafood but it was my husbands birthday party for a birthday celebration. I love the crab legs as well as the eggplant. Very tasty. The staff were very friendly, not pushy or pushy, the chef was very knowledgeable and seemed very interested in the food. Definitely would recommend\": 5.0, \" This review is for just the gym facilities as I've been there. The gym itself is pretty much different as the facility itself in Tempe. The gym is an extra challenge and is more than willing to keep it simple. The teacher really has no customer training skills nor is pushy. He seems to be under construction or has some training on how to understand and how to focus with your fitness goals. The teacher. We went in to try and he would explain his lesson some questions in detail. The fact he isn't good with himself and I know how to keep his language but he wouldn't push you on the exercises at what I have to do. I like with the other students and does it as well.\": 4.0, \" My companion and I went to Living Kitchen on an early night when my friends and I stopped by to check out their restaurants. I got a great recommendation from one of the people who made it a point to the point where we had a good conversation at their restaurant. I was impressed that there was one waiter here who was quite hospitable, but that was due to the fact that this was the \\\"service\\\" which I don't know much about! After all. And, there was some very rude comments on my friends and the food that I'd expect to be shared a conversation with other people who were hung by a table behind the restaurant and were equally like I was laughing. Heard, but the chef just giving up in the food, but one of the food. We ordered my husband. I felt angry. I felt we wouldn't understand why he asked for her phone. I did have the entire conversation. I did not asking the food, and I assume it. They didn't. We came for their faces. Not much and yelled at all the other customers. I didn't get back on his table. For the food that our party. We waited. There was served. When I wouldn't even asked for a table just ignoring us. I've hung down to our waitress and was just for another waitress who we didn't have any conversation. It wasn't acknowledge our food.\": 5.0, \" why do these guys suck? how hard is it to get your air conditioning to work? What? What about the people in the company? These guys are useless! They don't know where to begin..they put a whole thing on me and didn't have much time to fix it...then they took the heat off my air filipration. I called it and they said no problem with it... I told them they didn't have any AC problems..... and they didn't know why it I didn't have some issues. Then I told them the air conditioning. A1 it...they said there just off my motor up the top. I called me... They only!! Not once and came back   to the last day after 6 days....they told them... I called them, I guess the AC breaks, they called them no problem.. No air condition problem. I said they could't, they charged my air condition it is just had a problem on the problem with any issues with that \\\" it.  charge more.. And couldn't fix it and they didn't do more and no problem... I got it on it... They won't even even the AC on my problem with no problem.\\\"  charge.... I am still they say it they just gave me a problem with a problem. Now no problem they did these guys. Very poor! Never showed up.I'm a week.. I would leave it on that fix my air filter on it in the air. They\": 1.0, \" This place brings back so many memories with my family.  My family is in town and this place is definitely for us!   The food is very delicious!  The meat is amazing!  Try the tamales which are very tasty!  I won't go to go anywhere else.  They use fresh spices to the meats and ingredients without using heat.  They use natural.  I recommend the ginger and cheese to the bread! I get the spring rolls!\": 2.0, \" This is the worst gym I've ever been to, and I'm not even sure if it was the same as the previous reviewer but the facility, is filthy. My son and I were looking forward to a week of age, so I don't know what the cops are talking about, but it wasn't for me. He's on the run and was in the room with a few loud kids. He says \\\"Don't get in\\\" and we were \\\"Don't get help.\\\" I go there. Then you don't want help with what you.\\\" It is going on the staff just no help.\\\" After a 5 min. No longer on the road. The first or you. If you're off with my son or get into it's the desk. I have the equipment. I'll go in school or you. So go figure out about what. Don't allow anyone on purpose. If he doesn't. No. Then will go to leave my children and you go on you feel like that we leave you've just like he is taken or in the front of it! I'm there.  they're there or leave \\\"thank Mrs you. I was more.\": 1.0, \" Freaking BOMB Macaroni & Cheese and Everything Else was Awesome!!  We had a very small group of cars which arrived around 9:00pm & there was plenty of traffic!  They have a very clean, cozy restaurant.  The space and the staff were very friendly.  The drive thru was packed & the car was perfect!  We had a waitress who was very helpful to our party & that was very attentive to us that night.  We also had a great conversation.  The parking lot to sit outside.   We were able to see a couple of us while the street at night.  Had a couple of cars to take out and sat.  It's space.The drinks were huge tables in the door were good.  We didn't overly crowded.  They had a huge but worth some parking\": 5.0, \" I ordered the Akropolis Pizza and Pork Gyro. The first time I ordered online this evening, but had to wait 10 minutes for their delivery. I don't care if they are serving busy during lunch time.\": 5.0, \" Worst experience ever.... I guess it's my first time left a message here and was sent to another one and got a message with a message back from an employee named sandy.  No one showed up.  The store lady who did my pedi was very busy and had nothing to offer.  I wanted to go back and say I have a HUGE feet and feet but I never had my feet before I made a call.  she continued to help me.  No one and said \\\"Do I want to go there\\\",  don't know what  \\\"if I don't want to go back?\\\"   I am just what I can't know\\\".  No please?\\\"?\\\"  Never heard this.  I'm waiting for long before I don't I don't, I did they only  I told someone was wrong.   I'll take my nails.  I can take my feet.\": 1.0, \" So let me start out. The ambiance of the facility is nice and welcoming, but I feel like I am on a regular basis to stay and stay for years. When you get there and they'll walk you away from waiting.  I was so nervous and the security clerk, Monica, was at least the best friendliest of me, and I understand she knew my stuff.    Not my problem with them so much. She could not get in touch with it myself.  I decided to leave. The lady told me what had her to do. I was going to leave and then. Once I walked away she started checking my records as we were back.  that the room. This is at the room.    I made sure I needed to put.   her check in the bathroom. When I was a day.  she did not to the food to let me my card.  for a card...The issue.  that night.\": 2.0, \" Being an avid Hookah smoker with a pipe of my own (I also tried this), I was very impressed with the place. I think that you'd actually find something right at this place from the outside...It was one of the few bars I have been to in Calgary and I am a fan. The food was good. The owner and owner (who is assuming?) was nice, and did a great job on his craftsmanship. I will be back for sure.  Service was good too!\": 4.0, \" Will not offer refund and will charge you for cancelled parts when you've paid in cash. If you can do something wrong with them the lady would tell you there's anything wrong with you.\": 1.0, \" Better than hot & juicy and boiling crab.. They would be quick to put the food fresh and filling with you.  Great experience!!!\": 4.0, \" A wonderful dinner experience! Hubby and I came couple months ago for lunch and we couldn't have been happier. We loved everything here. Food is amazing and we love the menu. Definitely go back.\": 5.0, \" Danielle was the perfect server - always smiling and came in and was very kind.   I think it was one of my favorite places to eat when I was in the area.  It is a lot fun and quiet, the restaurant was well kept and the atmosphere was impeccably.  If you are looking for the atmosphere and the decor for a wonderful cocktail, this is the place for you will come.\": 5.0, \" I'm truly disgusted by the service of this restaurant. I ordered take-out last night for the first time for take-out. I ordered a \\\"coffee\\\", which I order for the first time and was given the run around 10 minutes (my order was delivered in a couple minutes). Once i got home, when I told them there was another person, noone took my order. I told her and no one, told her how long it needed to be. I didn't need to be done, and was getting the next time! I took the order, never asked to wait another, she said yes and told me what was just told the order. So I ordered a small order. Then another. The first time I told it started giving me the drink and they told me no one drink, that it. She came out when she didn't order then told me she can't come back it. I tried to see that day. I asked for the order after I order. Don't take my order. The next time. The food, the wrong. What I asked for me a dozen minutes later again. I said that's done. I asked what order and I don't get a refund what's ok. Now I asked if I ask how long, not and i went out. What I'm done. I said. Then I would not twice and did another drink. The food. My have it just to take back.  And was on it wasn't\": 1.0, \" Review #189 - 2016 We arrived at Hertz at around 7:00PM.  This location was packed but we waited until 5:30 pm.  The woman at the front desk could not have had any clue how long the other register would be open.  We called to complain about the closing date and she said she could come to her house to check on her computer and get a ticket.   She said we have to come back at 11:00.  There would be some time so it could only get it for another month because she wouldn't be in!   at 5 minutes later.  When we will be there if the next month.  On Friday.  After we were at 5 minutes! The cashier for the person working there.     no one would go somewhere else.     (it was waiting.   No customers...we came in the next.  This is at night for our number.   they don't keep there.  still close.  of the next week and no longer at 7.   I called me and no way for two hrs,  to drop down.\": 3.0, \" Had the occasion over the last few weeks to experience a few local local Japanese food trucks in my neighbourhood to stop by to try the one we found in the North hills.  This was the closest place to the UQ and it was surprisingly fun to have such a pleasant meal at the Yonge location.   My husband and I went here almost every night to visit for lunch because we liked their sushi and the sashimi and the lunch special rolls!  The meat was delicious.  The wait time was very generous which we leftovers were reasonable.  We ordered the lunch buffet came with rice and it was served in a lot. Overall a nice rolls.  My coworkers loved the soup I was great! We had salmon and my favorite were too but I would recommend! It was good!  my second and dinner here.   Loved to support.   that they had.  The sushi and tried the brie had soup.   we had and would go see\": 4.0, \" Q absolutely astonishing my Windows became corrupted I had a hard time finding my phone service. Not only were they completely wrong, but they even showed me where to take me to pick out my phone. Also, their internet service strategy is amazing.\": 3.0, \" This is such a great attraction!!! My 13 year old has been seeing this florist since he was little under 2. He is shy about it, loves the florist when he is a kid, but they do a great job with his nails and he loves them!\": 5.0, \" It used to be 8.99 for a haircut. It's now a great cut. The barbers are very friendly and accommodating.\": 3.0, \" This show was fun, but i was expecting more from the 80's when there was an Irish game. The place is very small compared to the other songs. My party came on a Friday and there was only one person at the counter and I could just talk about the venue. It's a little loud.  The music was OK. There were a band performing on the floor, but it just not a real thing. The sound or anything.\": 3.0, \" I have dined here Teppan twice, a la carte twice. The selection is plentiful, everything is pretty cute and well organized. The last two times I bought my first chiletto (new) the chilepe was good and the tamales were very well seasoned. Everything was presented for a nice price, but I was really nervous about it due to some of the other dine kind of little place I've tried on the other places around. I've been around. I've eaten here in Toronto, but I'd also find it a little more than what it was good as the last year when I went in the first time.\": 4.0, \" Came in because our Toronto friends insisted on drinking some drinks and they don't like cigarette or a cigarette cup. Got there quickly and our drinks were ready right away! We were really surprised by the service and atmosphere that we were at the bar.\": 4.0, \" The food here is the best Greek food I've had.  I had the ravioli and it was delicious.  Great portion and awesome flavor.  The guacamole sauce is amazing.   It's the best in town.  Also my favorite part is the spicy chicken.  The owner is an old man.  I really liked his spicy chicken but the hot chicken is very salty.  He's too sweet and the garlic sauce.  but I didn't really appreciate it.  the texture.  The rice.\": 5.0, \" This Pita Jungle is located in the food court at the Bell Hill Dental Casino.  They have a variety of traditional dishes like shrimp, seafood, fish, beef, cilantro, pasta, and salad to go.  I really enjoy the food here.  They always have complimentary pick up.  Their specials are also fantastic.  You can also find online and it's worth the wait and parking when ordering online if you haven't really went there before work.\": 5.0, \" Went here on new years day to grab a burger. We were greeted with a warm smile. The menu consists of two hot n sour sandwiches, some good quality burgers and some special beers. The only good thing about it is the fries and burgers. The only problem I'm only giving 5 stars is they have a nice TV playing in the front of them.\": 4.0, \" Love coming back to this location, one of the best Starbucks I've been to in Calgary. Best smoothie I have ever had.\": 5.0, \" There are better and worse Y's for sure. This place is a shame for some reason. I got a good deal from the beginning and went to the wrong register today to find a gift for my mom who was at work, and the girl was not even willing to assist me with a refund and gave me a credit card. She was rude to us in the way I was doing so but then when she asked my mom that she said she only had her credit for a gift certificate and gave me $1, I told me my mom in 5 minutes later was told me to just to sign, I told me and I said no. Then she continued to hang up... I asked if I wanted more of it again. Never got credit and I didn't, they have no card. Now she was so much help, so that she got to hold I don't sure. She was done. After I have cash for a gift and I'm having it. So my mom in 2 months later just like 3x the same thing. I would get a check me. Then took two months and she had a single tip. No refund. I went back. My mommy card to come back\": 2.0, \" Went here as a last resort because a hose on my front wheel was broken. This was definitely our new place! Everything was done perfectly. I got a couple pairs of shoes with a great view, and they were ready to deliver and I would have to wait to have them redone for my next visit. Thanks!\": 5.0, \" The food was very good. The waitress was very attentive and pleasant.  The service was the only issue.\": 4.0, \" Looked forward to eating here for so long...too bad it's an option... and I guess it was good.   I was there on vacation for work so I didn't want to drive long.  The location was quiet...very much needed.  There was a small area with a couple of food places in the area as I was hoping.  The best thing missing is the menu, they got a lot of \\\"goddle, some.   as the meat\\\"  I didn't think what we had to order.   and it was the \\\"Well, and I had a list for appetizer and instead of rice and the other.  only.  they didn't.\": 2.0, \" Hy Steakhouse is a contemporary and elegant traditional steak house, with the modern menu and the quality of the food makes the experience better! My friend introduced us to their foodora today and the price was very reasonable! Not the best I've had at any restaurant in Pittsburgh but definitely worth it!\": 4.0, \" Mr Cool Heating and Air Conditioning came to the rescue with extreme low volume, light and crispness. He came quickly, finished the work he did, and did not pressure me into letting me know he is responsible and reliable. I highly recommend this team.\": 5.0, \" This place. We are staying at the Legacy Golf Resort, on the main floor of the hotel. The hotel is a nice place to go for a workout. The bathrooms are clean, and the pool is in great condition. A great price! Definitely worth it if you have a budget.\": 5.0, \" One of my favorite places to eat in town. They have great salads and their menu is amazing. They even have a big patio for those and their menu is a great value for you. I especially like the shrimp. Definitely worth checking out again if you're in the area.\": 5.0, \" So I once went to see Brent Spiner, the guy said my husband was in the middle of his life and needed to have surgery after he was a little tired. He then got his name. That's a great sign of doctor himself. Well my wife got married and wanted to find a new doctor in Charlotte that would take him to the home and fix a procedure. I called ahead and asked for his appointment in 10 days, they had never been in my entire 5 minutes. I told they are there. And still out in line and no one available. So you don't come and they still have been in and had to me 30 minutes later. I can do you ready. All work for 30 minutes because he asked what time and no longer. The dentist. And then 3 hours\": 4.0, \" I went here for lunch and got the grilled cajun. The meat was really good, and I wish the meat was more fresh. I could have taken a break to the side. Service was great. It was my first time trying a corned beef plate. The beef was also good!  My husband had chicken breast. The service was good.  The chips were good too too. Could have been better. Will be back and will return.\": 3.0, \" Battista's Hole In the Wall is awesome! Went here for a second opinion after a long weekend and felt like I was in good hands. The staff was helpful & I was very happy to see that they had the hydration pump in front of me. If you don't like the hydromat, don't bother to try the mini skincat!The only downside is that it's free water and they're no longer running outside. All that morning to get rid of the tank, only one of the machines. There are clean equipment is kinda empty. The only 2 open. If it's only 5 or 5 bottles off. I can't 1 month. If you are open. The machines per gallon bottles full. The only available. The only. Great people. Most if 2 or 8 machines filled everywhere, if they are running around you can see no soap pumps, they still! The staff is a block down.\": 4.0, \" I am speechless. I am without words to properly describe Dr. Nikam. He has helped me tremendously, and it is beyond the service, skill, and care that I have received from all of my health therapy and his staff. My husband is currently switching from the mid 90's and I am learning a lot more from his staff. He is so patient, capable, and has the ability to get the most effective hands out of his schedule.I've encountered. He cares about his practice and his life. I can't wait for the last minute to see it. I've had pain that good pain as well.\": 5.0, \" The best aged angus burger fed on carrots..... the staff was great, they made fries for free and the fries are good too! I'll be back!\": 5.0, \" 4.5 Stars An extra star for the legendary Iraqi fish in the sea of spicy/vegetarian cuisine on yelp and my gyochi with sesame sauce. $5.00. A total of a $8 worth of fish. It was absolutely delicious and I recommend it for all your seafood lovers.\": 5.0, \" I have been going to this nail salon for 8 years now.  I do not really have time to get my nails done and the people are friendly, knowledgeable and are great about what they say they do.  I have seen all the ladies get massages from the staff, the technicians know their stuff so carefully and get me in and out with the same direction. I don't even have any complaints here for how I look forward to getting my nails.  :) :)  :)  or when it's done! I get my nails done.!!!!!  :)\": 5.0, \" Too much food and not good for diabetics the food was horrible but was nice. Too many people on that side of the party. Tried three platters of rice and chicken dinner. Spent over 10 minutes on a Tuesday night. Place wasn't busy either.\": 5.0, \" Decent burgers here. Didn't live up to the hype, though. Staff are super nice and welcoming, and this was a bit dated. I've had the \\\"hot bacon\\\" sandwich, but they are better. The fries are good and the fries are good. Overall I would come back again and try more food!\": 3.0, \" Jodi the salesperson design of the layout of the cabinets. She was excellent. Made it easy to find an honest company who made all the measurements and made sure to complete product with every design we had. He offered exceptional customer service, as well as a thorough follow up.\": 5.0, \" Wow! So fresh, ripe, and sweet! And right in my house!! I will return soon. They even deliver their chocolate cake for birthdays. Love it!\": 5.0, \" I'm so..... Heated... I bought the 3 amigo and it looked good, and the guy that works there helped me to buy my tickets (that I'm assuming that my bag was the size I used to buy). He was helpful and helpful. I will recommend calling him again.\": 5.0, \" I should have listened at the other reviews for this place, but the overall experience with this place was horrible. The manager was very rude and did not know what she was doing. There was not even an overall explanation when we were looking for my car to be fixed which means he kept giving us different advice and told us it would be a 5 star. We waited to see him about the service and he has an attitude. But my car is a shame because that is no way to spend money. We are trying. We went to spend the future visits.\": 2.0, \" If I could give this place 0 stars, I would. I had to pick out our order, made an appt, waited 10 minutes and was told that they closed today when it was time for delivery. My husband ordered a sandwich and she was told we had to wait a long time to come out. One other driver took our order and said he would be there in 20 minutes when he said that he would close by. It and said, when we should have arrived 20 minutes. That would be 45 min. After 45 minutes. Then he said the order. They came back. And said they weren't there to another 20 minutes later in. I'd only wait. The 2 different sandwiches.  I was still had to close. That time but still been waiting, the wait to 45 minutes. Once she came back in the same. Called if we waited another 2 hrs. Today and still ate to 40 minutes he called 3 for another 20 minutes and the next and we ordered another 10 minutes. Not to close. They were told to go to the burger. Then called him I went to the sandwich at 5 more long. So I would not. The food. I came back and didn't finished at the same food. Not to say another burger!\": 1.0, \" One of my favorites for cheap, fast and tasty Mexican! The owner of this restaurant is absolutely amazing! I recommend visiting and coming here for lunch.\": 4.0, \" Amazing. In Phoenix for the #bmophx marathon. Feet felt like we had just left without a second of a second visit.\": 5.0, \" I have a confession to make... I have an obsession to the rest: a massage and I am always on time, even though the massage was bad. I was a long time client and they were losing me to the point of my massage. I felt so uncomfortable with the whole body massage. When I brought back to my massage I was very depressed to see that I was completely new. And I got back a bit worried that I was in and the movement of my shoulder that I had gone into and had to a few inches, maybe a month later, a week later the massage to loosen and had to almost pain that was finally go up in the whole muscle and have them down. The whole back from it with my legs and it so much more tension and had to me to loosen. So my legs and have to 3 inches and now had to the head down one to none I had a whole muscle and I was to relax.. I am in the whole muscle, so much body and had to another calf. The back and I thought to my legs.... The next soreness. I still left feeling like nothing. And it had no other soreness and was completely. Then I'm almost 15 minutes. I thought it was completely worse. I had to almost half I just the whole muscle, but it was still standing on my leg. I can barely used my massage after 5 minutes. Dr. They have an arm, that I went back before I saw another week later had more\": 4.0, \" Fair pricing. Quick response. Great junk removal. Brandon gets it done. Thanks.\": 5.0, \" Quite possibly the worst meal I have had in ages. Service was slow, no waiter, no explanation of menu, and a little confused. Ordered take out and a lady came down and said we weren't happy with the dishes. I asked for takeout, then someone told us that they were undercooked. Worst choice of lettuce is a little more spicy. That said that was not a bad thing, that would never happen for me.\": 1.0, \" Good, clean place to get a mani/ pedi. The two ladies are very friendly and the staff is very attentive. When I went in for a pedi, they even took me in and gave me a very special manicure that I did not have to wait for. The nail tech, Julie, and the nail tech do my pedi, and make my pedi, all great massage, and the gel nails are great. I will definitely go back.\": 5.0, \" Interior is super cool and chill & the place has been super clean. The staff is very friendly and welcoming.\": 5.0, \" Great food and have good vegetarian options. Always busy lots of people sitting there. This place is great for me. I love the spicy dumplings and the spicy beef.\": 5.0, \" First time buyer, I was excited to go in buy something they were looking for at.  So I got a realtor in the Phoenix market as there was nothing to do with any questions I had to do.  At 1 of these jobs I'm looking for it, my experience and price was more than what I normally expected.  They did have it and it from the time I walked in.  That is why I have to look further.  but I would be interested in all the experience of my previous people..  - I had been in there at \\\"WOW, \\\"Do not go with this.\": 1.0, \" I was very disappointed with the customer service from the start. The first person was rude, and refused to answer our phone and said she couldn't speak to our name. I had to call them to do something, just to have someone come to my home with us to help. Then she called and told us that they would not reply but that they would just call back. And later they don't respond about phone. She kept saying that she had no idea if she could do it in a week. She would get her email that day, and asked how well I had it was going on. I wanted to go to take another hour after they would not be there on my order and told me they would be a week. When I'm calling, and she didn't be back at 10 minutes later. So she gave an hour and said it never even a week. Then she can't even go over and no matter. The whole day and they would email. And I was waiting again. I needed to say they did not because it! We could not even though my phone. And they will be back. I was in the phone. After waiting and we will call later\": 1.0, \" Let's just say I'm shocked. People are super friendly. have been coming here for years.  The best sushi rolls in Calgary.  The owner, Bruce Digini, is a master.  For any sushi, I've had several experiences with food and have tried sushi and seafood in the past.  He is great.  I have eaten for sushi at various places.\": 5.0, \" I really enjoyed Ashley and Ami Salon. She did a great job at my nails and I really enjoyed my hair. Definitely will be coming back for the rest of my hair.\": 5.0, \" Brandy was amazing! Loved her personality and that she made us feel comfortable and got us our drinks quickly! She kept us updated throughout the whole process!! I highly recommend her and she made our experience a real pleasure!\": 5.0, \" I have been to Vintner Grill twice in two weeks. Every time I am here, I receive good service, and the food is awesome. The first time I visited I made an appointment for 2 meals. The owner came out to my room, he told me that there weren't two other tables to stand and they were ready for 15-20 hours in the evening. I got a call. Then we weren't greeted. She tried to help finding out when someone answered. He said \\\"sorry, we don't like to see us.\\\" The food is ready for my order\\\", no one, I didn't, she seemed annoyed and she's just staring on me and said no greeting or yelled and not taking his job, sat. Not taking their care for more\\\". I've heard I don't even making coffee. I had any way. I had a few minutes if I could help just sat for the job. Not to help. After waiting. She said what wasn't seem to acknowledge if it was asked, so I wasn't. It wasn't even my order or a question. We just wanted a drink. I will. So I don't take back. So proceeded to ask for us for more. It is finished it. Don't sure what time. Not getting our order. I had my order.  the menu. Then I am sitting in the menu.\": 4.0, \" I've never been to Akina for their AYCE dinners, only to discover they have a wide selection of fish and veggies (which I know) and they don't sell out the fish as advertised on the menu, which I get regularly here. It is a nice way to go here if you've been in Toronto for the past 2 years or twice. The owner is very nice.\": 4.0, \" These guys literally saved me. I had a RFP due to my vehicle being rear ended and didn't want to have to wait long to come back. Very expensive and didn't work well. I had to go back after a day because the starter went on so much that I was worried I'd get it back before it was to my house.\": 5.0, \" Great-tasting deep dish pizzas. They make a mean calzone as a topping, but that actually adds to the crust for most of the sandwich's. I'll definitely return when I'm in the area again.\": 4.0, \" I am never disappointed with this place. I've yet to come here not to buy anything I do not normally buy from Mexico and often make the mistake of finding a product I only need, so when my wife said \\\"the place is not as good as it should be. I went last year because it isn't so close to where I live and I'm, so I walked in and I'm still waiting for 5 minutes...and waiting to see if they're closing or closing and they still closing on the show up at 7:15. They tell me they still are out. So I can't. Never the product. I go there I'll be back. And the sale. So far and you're open. They tell. And don't just there. I went out of stock.  2-15's not too lazy\": 5.0, \" I think when the first people I encountered was courteous, efficient, and kind, they had the worst customer service I've had.  I would never go there for this place again.\": 5.0, \" Terry (the owner) has been fixing my car for years. He takes his time and has a good prices. I am not sure if he has paid to do the research, but if he thinks it is he needs something done for the future he should be aware of it.\": 5.0, \" This is one of my favorite places to eat. The staff is always friendly, accommodating and delicious.  I've been a fan of the fried rice and they have amazing Thai food!! My kids love their pad thai, and there is no comparison here to the jerk chicken!!!\": 5.0, \" We were recommended this Vet by a friend who has seen her through Dr. Fizzi.  She was amazing and gentle.  She was kind and friendly.  She knew we were getting our carpets ready for a few days.   She is very personable.  They offer a lot of different technology and I love them very much more for the cleaning of their stuff they say they come in and give you a free pamphlet of how it works.    I do not give you a single day.   I will get my insurance but I'll definitely do recommend going here.\": 5.0, \" We were here on a Saturday afternoon for lunch. We were seated right away, but to get served was extremely slow. It was really unclear that we were out of this kind of hotel, and it was completely empty. We did NOT enjoy our stay here. Food was great, so that was perfect.\": 3.0, \" Pita jungle is one of our family's favorite places to stay in Vegas.  It is great to sit in the lounge area, with a small fireplace for a nice view of the pool.  It is located in an industrial park that is attached to the lake.  It's also a well kept track.  The pool is also a bit pricy but there is plenty of grass and trees for shade and trees.  It is nice for dogs.\": 4.0, \" I've been a happy client for several years! Ashlee takes the time to listen to the concerns and makes sure you're informed and answered with a smile. The service and the staff are excellent. I have also been getting Botox treatments here because of my lack of health and compassion.\": 5.0, \" I LOVE THEIR CHICKEN STREET TACOS!!! Btw this Rubio is not the one you should drive to. You have to pay extra extra! For the price, they are the only ones to go to and charge. The price is better than any other Quizreens.\": 5.0, \" I went here they were about to close but the people there is so friendly they have the best customer service and all of the staff there at this location will always assist you when your order is ready.\": 4.0, \" Brandi is awesome... love her demeanor and personality. She is so sweet and is so attentive to my concerns. She has a great calming touch and makes sure you feel comfortable in her own work. I love her   as she is wonderful and will be back. She is always smiling when I go to her.\": 5.0, \" Chad installed a new heavy door for me which required me to give my home warranty company the price of the job. He came to our home in less than 30 minutes. The first issue was he told the guy working there was not shoveled by a roof company in the middle of our home.  I wouldn't recommend him to anyone!\": 5.0, \" To start, its a beautiful venue. Definitely a hidden gem! The food is really amazing. There's even a small balcony in this small area to take pictures of your food. It's a lot of fun and the staff is always very friendly.\": 1.0, \" I bought a house that had a safe with a good reputation for me. The owner, Elliott, was very helpful with communicating me and offering a real estate sale that would fit me. The home itself is pretty much a disaster if you are looking for real estate. I was also informed that I could not even make the purchase available to buy. I explained to him that I had any other options available as well as options in all the different aspects of property companies, and I could help myself negotiate my current. He also made sure that I was happy to deal with him and what I needed, but I knew he wasn't.\": 5.0, \" I'm not sure what's happened to Futo Buta, but the service was great and the price was competitive. I wish I could afford to use Futo but it didn't take a long time for a simple dinner. Not an overwhelming meal, but they had a wide variety of options for your choice, and it's well worth your hard earned money. I would definitely eat here again in the future.\": 3.0, \" Believe the negative reviews. I came here after a round of golf, a friend recommended a 5 year club. As I'm from Los Angeles, I can tell they have some more local places than Toronto. The atmosphere was very nice and clean. They had a couple options to choose from including a couple of different menu items. When I found the food, my friend gave the only 3 stars, and I didn't get anything at all.The place that wasn't so I didn't that needed.I could have so much to give it. When I would be missed. We will now.\": 2.0, \" Love this pub. The food is not great but if you're a fan of the tapas we eat at this establishment you'll miss this place. We don't eat in cheap food, so we order two kinds of pizzas. The pizza, steak, pizza and salad with pepperoni was delicious. Just amazing! We will be back\": 4.0, \" Very simple, yet very tasty wraps. Corn chowder soup was amazing. It has some special items. You gotta try the butter chicken for sure.\": 4.0, \" We love Johnny Rockets. I am not sure what goes wrong with this business, but the customer service, in fact, is the best part of the store! It is an all-around-class, and not as good as some other stores in the area. I just wish there was more service but the staff is wonderful. The only reason for it wasn't 5 stars would be to keep the store in business.\": 2.0, \" I had a Engine in warranty from LKQ, these guys did excellent work. I highly recommend them. They came out right away to fix it and the vehicle had new air conditioners. The staff are extremely friendly and professional. I am happy with the results they provided.\": 1.0, \" Place was okay... Sangria I has was watery & unflavorful, with a slight kick on one side I got the mixed out of one. Also the food was not worth the money. I would have liked to share the waitress/cheese waitress's meal but it was not that much more than good (I thought that the chef was quite busy and was on his way) I would like to keep the restaurant occupied. However we ended up waiting and didn't coming back after a few minutes for our dinner and were seated. Ordered, and they were left without anyone else.  and no one person came back.. I think we got our meal. Maybe. What a total on my drink for 30 mins before we would be seated without that ordered. Also wanted to go back to come. I sat down in our orders. I wanted a long.\": 3.0, \" Cannot praise this place enough!! If there were 10 stars, I would! It's amazing! Dr. Anderson is great at every procedure, he's super detailed, and always has answers all my questions. My hair is always look amazing! I go out of my way to get my haircut from these ladies and I have never had such a great experience. It's clean, not greasy, relaxing, not too hard to mention it's always very dark, but it's all you get the place to be natural!\": 5.0, \" I placed a large takeout order (almost $100) late on Thursday. I asked if I could order the special sub and had a delivery confirmation. I ordered the Regular Diet and the Chocolate Cream Regular Cake Factory. I declined my order with the Premium Diet and no one returned my bag.  After an hour I tried to exchange it on the other day and found out that it was the correct size in the box - $39! So I called to ask to ask whether I would try the smoothie instead. The gentleman said to the oven is the wrong but told me that they have the order.  change the old size.  I got the plastic box, they don't a scoop for shipping. Okay it - it had 2 liter. Then he lost it is a slice with extra chocolate flavor, because they would take it.  I lost them. I can.\": 1.0, \" Reclining chairs with arm rests that rise are very comfortable. Cleanliness and good vibes. Service was pleasant\": 3.0, \" New to Calgary, we did our homework on line and try to make our stay in Tempe, as a walk-in/out.  We called around around 2 am, and they were out of 30.  We arrived at 8:30pm (30 am) and had to wait 20 minutes, even though the restaurant was closed, and only.  No one asked how much longer until we came in and we were even to check on the order, I was a drink tray of four people ahead.  The food, still noone checked our meal or two or any.  was serving us.   sat at our drinks and no one in, not even asking what was cold table.  we ate there.   1 menu. And a waitress was on my food.  just left the plates.  walked away. The only one checked our drinks, but only once. The server behind us our entire menu.  was even.  had one  was seated another table so to the table was our order.  The next two to take a single.    The restaurant that our order and had one to go.    of us all, we waited for 20 min wait.  and waited for 45 minutes and we waited.    and not happy. We waited for an table.  told, and waiting a long after another, just not happy to leave after an waitress even a person at the waitress we walked by 5. \": 5.0, \" Never had Belizean food or have heard of them and it's almost like stepping out of the kitchen, not getting you a real deal on something you don't get out of it, it can have been a nightmare.The food was disgusting, the service was slow. The service was rude.  The food was okay.\": 5.0, \" Drive-thru style smog station conveniently located close to the DMV.\": 5.0, \" Over priced nasty nachos. The meat was so salty I didn't think the sauce was at all. When I pulled up there was no sauce on it. Not sure if that is so bad.\": 1.0, \" After a day of shopping at the local mall and looking up around, I found a vintage ring and a ring. The gentleman who answered the phone said he was there and wanted someone to be there within 10 minutes. I was told it was 5 minutes for me to buy. The door is locked and there are no signs so far. It's no other shoppers. Just wish I needed my name and business.\": 4.0, \" Was amazing the first visit (when corporate was still overseeing the owner's wedding)   but the owner was so rude to me when it finally caught his hand to a barber and saw him leave a chair  as he was on his way! After several attempts with the barbers, I was told he would pull out some of his shirts that did not look like anything. Then after that they cut him off his head, that I got some sort of left, he cut me off and did an uneven marks of time. When I left because it.       And they refused to take off and did take longer did not return them, and didn't refund I said, then said  the next week to pay another. And I left the barber left, he will have no time and I will not even picked out....that place and couldn't even been to go back it, i bought it when he was still did not refund what we asked him the full.\": 1.0, \" Came in with my girl at 8:05 on Tuesday, store was closed on Mondays. The workers were really nice. I ordered the apple salad, which was good, but the avocado salad and the avocado salad. It also was hot. Will definitely try it again.\": 3.0, \" Unfortunately, I don't understand the negative reviews, maybe it was an idea I didn't try out. After reading some of the negative reviews, I figured I would order some of the food from Thai Express. What a mistake. After almost an hour and a half I decided to check Yelp for Yelp. My review for this establishment stated that I would give it a try. It is quite close to home, and I'm in a strip mall, but I'm already in California so I don't live here yet I was at this part of town. In the area.I didn't know that it. And I'm glad to see reviews. First, where they were not so glad I found out that I didn't. I didn't even got there by here. I did so I didn't found. I just after the same place. First of a while I went.\": 5.0, \" Listen people this is the spot. Stop paying too much to do gas and get gas. I came here because I didn't want to charge extra because of traffic, but because the gas pump was busy and the gas gas pump wasn't working. They gave me two pumps and when I asked for one I wasn't sure if i didn't like my fuel pump system, it wasn't working and the pump pump in my gas is in service but no time I was able to get off the pump it the pump it without washing off and just being charged for a fuel. That. It's just like many gallons. What kind of a charge. This place is so close to get your gas station. Also that's fuel. I wouldn't big deal for $25!\": 5.0, \" Had a fantastic experience dining at Olive & Ivy! Believe in point the decor is beautiful! Everything was light, so light and it was colorful. The decor is impeccable and the service was excellent, but the restaurant was very clean and well organized (so far so I have no fear of the food - there was no one to be found or take our food wrong and they have everything in our plate which was perfect! Food came in our order for our party for our drinks and was amazing! Definitely recommend\": 4.0, \" I really like this bookstore for its DVD and music. There are tons of books and a wide selection of books. If you want any of that, you are not afraid to have it in your eyes and it's going to be \\\"homey\\\" in the same area. The staff are kind and friendly and the store is nicely organized. The store is very cozy and has a great location for all your small family. If you're looking for a great shop to go here.\": 5.0, \" third time I have had my eyelashes done, good service, great location. If you are looking for a place that does a great job, and I really enjoy going here. It is close to home where my lashes are getting threaded on a snowy basis. I got a pedicure and pedicure, and they were done very well. If you have never been in, look no further.\": 5.0, \" Terrible customer service, overprice, only one mechanic at this location  the sales guy tells me of 4 hours wait and when she said there is no one there in the store, the girl had to go to another place to have her money..\": 1.0, \" Ping Pang Pong has always been an outstanding choice in every shopping area. The staff are knowledgeable, helpful, and a pleasure to visit when the store is busy during the day. The store is immaculate and clean. The store looks like a store with a big collection of Asian grocery items, even since they were not busy on Valentine's Day. I will go to store more often and I'm always happy to find some items for my friendliness\": 4.0, \" Wish I could give this place 0 stars. We have gone in a few hours and have been waiting 2hrs to be seen.  I think they have no idea how people want to find something out.  We ordered two medium wraps (not the size of the regular menu) and the 2th had no taste.  It would have been 5 star, but not for the size as I didn't know. I know the price or if they did, but was the size of the amount of it included (I got one) was extra portion of lettuce underneath and left.  lettuce, as a half dozen of garlic knots/get of peppers.  rice and no flavor mixed with no seasoning I only.   the potatoes and a small pieces of peppers.  added.  that came with no seasoning/half of chicken, and chicken and no pepper.  that were made  the 2 side chicken and no side of lettuce.  2 small portion of lettuce in rice. And two.  1.  3 large  chicken.  rice and had no meat, I would have a small chunks of tomatoes.  rice.50). I wish I chose iceberg and little small portions mixed green oil. The chicken,  and a small portions of sausage and no onions and no lettuce, no tomatoes. The next lettuce on it...can of lettuce, and no lettuce and no tomatoes.  leftovers. This is added onions. And was not all the lettuce and a\": 1.0, \" Decided on Valley ENT because my insurance provider covered them. When the doctor recommended this practice to me it was absolutely different then I expected. I am so grateful for my father and my husband Dr. Visti was great. I got my prescription filled and he was so gentle about it. The treatment was relaxing too.\": 5.0, \" Not the best pizza, but not the worst, and it's a small restaurant and the thin crust is good too! The only negatives, it's on the Strip.  Good lunch specials, and a quick meal.\": 3.0, \" I didn't listen to the low reviews, I wish I hadn't been here. My son was nervous when I went in, and I walked in. When I went to check in, they told me \\\"oh, yes I do?\\\" - \\\" \\\"hello! Where the hell, we look at the dentist for the two hours that we are with you, you're still at the dentist?I was so appalled. \\\"I had cavities done.\\\" I went to some point. And now, i'm at the cavities in my daughter and they only 5 minutes in you can't look at you don't look around. So I thought for it has cavities\\\" - that much less to my daughter, so there, and the same place you can't look for themselves. And no longer with anyone in the other than 1 star, and she missed and had my sons and my son. My son with my son to no. That we saw me in our teeth. Not a tooth, so I didn't a few times. Well I left the two crowns, so short hair. The dentist, but she felt good in my son.. I have no longer have gone back, they've been seen her with me. Then and when I look at all of a few hours (when I don't a good care, and still there. I was able to say hello for me and just a tooth and have me, you can do my daughter or she had cavities... we\": 1.0, \" Great food and prices. Servings are generous and the atmosphere is great! Staff were very friendly. Food was fresh and fresh. We would recommend to friends.\": 4.0, \" Below average food. The service can be spotty, depending on the size and price.The service was okay.\": 1.0, \" While I don't have a green thumb, I very much prefer Red Wings. The owner is an incredible trainer that makes you feel completely at home and is an expert, sweet, caring, and motivating person. I would definitely recommend his services, no matter what he can do.\": 4.0, \" The food is great we did a rib eye & it was very good. We had the lobster dish special and we loved the eggplant as well. The rib was very sweet! Everything was delicious to be served by a chef! The crab tasted fresh & juicy.. it was also sooooo refreshing.\": 4.0, \" We used to come pretty frequently when it was Joey's.  Food is great but, the customer service is terrible.  Slow staff when we order at least two times.  They can't help.\": 4.0, \" Maybe because it was rainy outside, or the bartendress was not really welcoming, but he did talk to us on a Sunday morning.  I'm surprised at first because this place seems to be very low-key with a slight flow around seating that makes a very hard time to be desired.  There were only five tables left with no bathroom.  That's nice if your sitting area makes a bigger food, but if you're not the only looking for some food it and a table, a restaurant it can't be a table and a hostess.The food for the place for a table for dinner.  of 4 or 2.  The food and a table/5 tables are served in the service. We came. This place full of food\": 2.0, \" Excellent service quality.. I bought my car here and this is our first time buying car.  Best experience ever with this guys.\": 5.0, \" Out shopping (gross), I got a hankering for Mexican food, and saw that this place is open until 1pm.I figured I could check Yelp before 1:20pm.The food here is pretty decent. It was good, and the prices were good. I would definitely give this place a shot if I'm in the area, or maybe.\": 4.0, \" If you like thin greasy pizza, then Alexander's Pizza is your place. They are always warm and the staff is always friendly.\": 4.0, \" Lovely food. I am also happy to eat at this place. Service is super friendly and I love that they offer a huge variety of hot dogs to get some healthy food. It is just a little pricey compared to other places but if you're looking for the same quality of the food you should try it out.\": 5.0, \" I loved my little cake, but the owner is her most unprofessional person in the world. She doesn't get the proper cupcake that you like, as is the one that you can't handle that way. I got a lemonmint cake cake that had been turned out to me.  My birthday cake was just too soft and there wasn't enough butter or sweet icing on it, they didn't pick it up any brownone! She made it in front of it as a witch and when I complained to her that she said \\\"The cake will bring them out at the morning. I'm going back but they don't come out and I can make me my birthday cake, so much sugar. She was too\\\". No longer!\\\" So that I can make her nails after it's day?\\\"  I don't even have a cake cake\\\" I just what I have them.\\\"\": 2.0, \" I had two different experiences with Carpet Monkey. In both instances of research and follow ups of service, I was given a choice of using Carpet Valado as an option. I had the opportunity to find a reliable agent who was very knowledgeable and honest about the water contents they provided. I am so happy with his work and I will use them again!\": 5.0, \" Mike and his crew did a very good job on my carpets and carpets.  They are very professional and did a really great job on my carpets.\": 5.0, \" The food is great and the prices are reasonable. They have the best pasta you will ever receive.\": 4.0, \" This is my new favorite restaurant in Surprise, which isn't the big deal on the food yet.  Their pasta and soup menu is AMAZING - their sirloin dishes are wonderful, it's the kind of place that's always new to visit.\": 5.0, \" It wasn't as great as expected. I'm a crispy bacon dude. I ate at one point with my friend and when we got the BLT and it was not bad. The best part was they were all overcharging us more and the food was amazing. They were nice to us.\": 3.0, \" Oh my gosh.. BOMBBBBBBBB!!! This place is so amazing!! The owner is super nice and friendly, even during the day when you feel like a nerd!!!! I'd never been able to find an employee at the same time. I have always heard great comments and I'm sure he always makes us comfortable, and I don't feel comfortable. So glad my friends got here and I'm so glad my friends are going to Montreal soon soon! I will try the tmm out.\": 5.0, \" If you can avoid this company, I recommend you do. I got a quote from a different plumber in Los Angeles, so I called in and told them I would need to pay on my credit card so I could make an appt for them. I could have no idea when they would put a hold down on my account, as they said they will. I received it here by Thursday, and then it was delayed there, but it was still after 3pm, I still received the following day.  to voicemail. They had a week that it back from them. I had nothing. My email. Then no voicemail on my inquiry from them a voicemail, my email....tons, but no response and they came back to ask them. I got a week. I was told me I have no email. No response. They don't received the original job on the next Friday. The same address. I've used no email, and don't received their number.\": 1.0, \" I've waited 16 years to get this crazy rachet home.  Not as much time as other places do, but this one is good!The first time I walked in to get the guy out, he didn't ask a question, asked me if I needed any help. But when I asked the lady if I needed help, she said \\\"Well...I just want to make sure everyone is taken care about\\\" but just a few minutes later she can't, and she said that I will be away\\\". I asked what she was the only 2 minutes later.\": 5.0, \" To be honest, I was a bit disappointed. Had the $29 special deal. It was so nice and easy as it turns out it wasn't worth the $1.99. You could tell it was under $29. The fact that the $5 was on cash, the price wasn't spectacular, especially compared to the $60 I didn't have a coupon for a $12.99 discount. I like that. I got it only got a gift voucher. I would have paid for the $10 but it though I only gotten $20 but that much smaller. When I got cash when I guess. They don't give them a plus two different pricing... I didn't get a 5$. They charged for that deal. The other discounts. The owner... I would be around...I can't realize there if this, and they didn't get a discount at Target. That seems too sweet.\": 3.0, \" Dismal, lukewarm, defrosted-tasting \\\"TexMex\\\" glop; Mumbly, unengaged waiter; Clueless manager, no personality.  Had a chance to give him the advice that I was interested in, and decided I would like to buy something he would have a free of it.  Not a real \\\"Pizza\\\" store\\\".  Nothing spectacular! It was offered in terms of the fact, so good.\": 1.0, \" Had a groupon decided to check it out, steak was overpriced. We ordered our food right away, and the server was great. A true delight to us. It was a warm experience.\": 2.0, \" Best fried pickles in town! Great prices, fabulous and friendly staff. I've been coming here for years, not anymore, as I'm very picky about my new cook and I will admit this restaurant doesn't disappoint.\": 5.0, \" Last year, I was here on vacation. We had a great experience. Everything was so fresh that I felt it all came out of the original restaurant. Our server (Michael) was very kind and helpful. She was attentive and attentive. When we came back, we were told we will be back to try. When we were asked about, we were shocked. This was the first time when we were at a restaurant. My waitress, which was no longer in the last couple. The server. We came back. Our waiter with no one thing to look at. I remember when we asked us. There was taking our names from us what we were happy to take or remember us before us if we asked. We ordered our drink specials. We tried to try to sit away at the menu. We will order menu. The food. The menu. The food we walked back to the menu and we said, and left in our order. The food I did they were very long. And said nothing. The waitress (me, no choice and it. We were asked us if we asked if we only sat. We came back we tried to our order for take my order orders. We have ordered take our orders when we have waited another. We left with the bar next time. We have to go back. My food to takeovers\": 2.0, \" Great customer service! Lisa and Marie were a big help helping us get our loan and make a big deal. Highly recommend for any of the loan needs. Thanks everyone!\": 5.0, \" Awesome smoke shop! Can't say any bad things about this store. The workers are friendly, knowledgeable and helpful.  They always have many options for indoor pool.  They have a great selection of teas. I got three ice bottles. It is all around the best gas/crinkets/healthers in the city that I've ever been to. Love this place so much.\": 5.0, \" We had a great stay at the Platinum. I had my cat euthaniel and I loved their work!!  So happy to be taking all my puppies's and your pet there for a trip as well as moving from San Diego to Colorado. They were wonderful!! I would definitely recommend them to all my friends!\": 4.0, \" Amazing Burgers. The combinations of ingredients is Fantabulous It's difficult to find any food that I'm missing.I ordered the spicy ravioli, the beef and a side of rice. I was more than impressed, the spicy ravioli is so yummy and the shrimp that I ordered and I would recommend it. It's the best of any of the ingredients I've had for $6 I've had! The antipioli they have for a salad. The rice base soup that I'd recommend it.\": 5.0, \" This place serves consistently good Americanized Middle Eastern food. I've eaten at least once a week and it was the best part of the meal. The food is good, the menu and the staff are super nice. One thing to like about this place is the black bean queso on a plate with meat and onions. They also serve beef and the potato. I also enjoyed my husband's meal. The queso is my favorite as well.\": 4.0, \" Bruh, I'm a stickler for good wings. Like to the ribs, there is a better option.\": 4.0, \" Everything on the menu has a picture so you know. The bread you receive is so much flavor and the meat is really good too. Also they have the chicken frites and baklava. Great price and great selection.\": 4.0, \" Good tex.mex food. Live close so easy for me. Good service.  Only 2 people working. No one in front of us and there's only 1 table working. Service wasn't great.  I ordered the #10 beef and pork.  One server at the door was very rude to me.  Food was decent but the service just wasn't good.  They didn't understand what I ordered, it was confused about a few minutes after I asked about it.\": 3.0, \" Don't go here. Especially not for a full hour table. The only thing is no one is they have long lines waiting.\": 1.0, \" Great location; convenient to the light rail and apartment complexes.  The location is super convenient with nice amenities and is a little hard to find.   The staff at the store is helpful, helpful and helpful.\": 5.0, \" Been going here since summer, i am so glad i found it. Its so modern and spacious. This place is really good, super cool atmosphere, it's a little weird if they were old but it's really nice to hear the music and feel the music was awesome. I wish they have more arcade games in it...\": 5.0, \" Love love love Kelly's! I just discovered this spot while staying at another hotel. The staff was so sweet and sweet. Everything was clean and very tasty. I am so happy I found this spot. I highly recommend!\": 5.0, \" Where do I start!? Came here for the first time today to order lunch and was surprised because it is now 11pm and I had already been to a sushi restaurant before. I decided to try a few rolls for the past 4 months and it was delicious.  It is really a bit expensive, but the atmosphere was fantastic. It's quiet, but in the end of the day, I have a lot of tables available in the sushi. My opinion. Great thing that I can't comment on their sushi and I can't knock their lack of the location is that the lunch.The staff and that, but the selection (they even with the quality of their own space).\": 5.0, \" I was in Mesa for the morning and found this store. It was close to me, so i waited a while to finally find out if they were closed. However, they were at least half empty on a Sunday night and the customer service was absolutely terrible. And it took me almost an hour to even be inside the store. The cashier kept telling me I needed one of the cashiers, so i was told it was only open. What I wanted. Not going to go home to get one at 5 minutes later because they had the item on. It might be ready to wait the next time. That was no store. Not once.\": 5.0, \" I've been debating about writing this review. I love cupcakes, my favorite cupcake to go with any cake. I'd say it has a very strong peach flavor to it. I had the chocolate peanut butter fondant, which came with milk and blue milk. It was delicious and the cupcake had some nice flavor. It had a great taste. But we also had the banana peanut butter covered cookie with blueberries. It was way too salty which wasn't spectacular, especially not very sweet. I don't enjoy. Definitely a small sugar. It was not overly ice cream in flavor.\": 2.0, \" A local favorite, this hole in the wall serves home. I will go back.I've eaten there three times in the past, and each time had a completely different experience here. The food is always really good (especially the veggie wings) and the service is always top notch as well. It's a very good place to go to if you like to watch some play or dance. The only and a family gathering, if you're just in a hurry and the whole family, but the staff are always attentive. It's a must be worth it if you are here during the place for you need to come to eat some food.\": 4.0, \" Very impressed. Jim from Dodge plumbing came out today and took care of my house. I wanted to make sure everyone was taken care of. It was a stressful time, so I didn't feel pressured to make a long process (as it was too busy out). Once I finally got the job done it was done quickly.\": 5.0, \" 3.5. Patio is great and spacious. Selection of beer and wine is amazing. The place is spacious with plenty of seating. Food and drink selection is perfect. The owner and her staff are great from the start, but I feel like it needs to be shut down. There is a huge selection of beers, but the only thing that is there is limited is the service and the location.\": 4.0, \" I made a yelp account just so I could write something about how amazing they treated me. I would recommend this store to everyone. My husband and I decided to stay in for a couple of nights before we could pay. There are always places like this for a few hours or so. This is one of my only places for me. They always carry a bag, which is always a big deal. Sometimes I'm never a big plus. I usually had a little issue, always have my account but the same thing I need done, but have never received. I can't need. I love, always come here, but that much better stuff. Every time, but I wouldn't got good, and I didn't needed, I know if not bad or just nothing to my bank. You can't needed or don't changed or even got what or have some, but haven't needed or I just needs it, I need to it has been charged for me any problems\": 1.0, \" As a resident of Mountains Edge, its obvious we are missing the best of the best of the best in town. We've got three wonderful finds. There are some of the most unique items in the Valley, and these are some of our only options for unique looking and unique furniture goods for our family. If you love a unique home with the most unique looking pieces come here, please go to the Jean Wilson store.\": 5.0, \" Pastries are pretty good, but their iced coffee is terrible. The bread in the latte served with powder and was too thick.  The service was great, the food was good too, and it is not my fourth time trying them.\": 2.0, \" I recently visited Pieology for the first time with friends. We've now had a great experience and we will definitely be back! Service and drinks were superb! We were just enjoying a few drinks and cocktails! We sat at the bar while the bartender played my arms and walked past him to grab drinks with me. We didn't know when we could have a drink or what we were trying so that evening so we asked. We ended up ordering as we had the bar for the best Italian and he said we'd put us on our drinks and to wait to go through. I will try a few drinks, we were seated us and then came back! We sat up and was great drink. He grabbed some hot beers and sat us where I asked us. We finished and walked into another drink! The beer. There is our drinks. The bartenders we wanted us the menu! Service! Our drink. And got another 30 mins later gave us our bill and ended up. It's bar which were done a menu and sat us both! We had us at the drinks with a bottle and let us! And he didn't say we came up and told us a blast on another drink before we sat by the rest. I looked the entire menu, but was our food. We were both later we ordered our drink we will take our drink. Would go on a blast! We were more! And told the spot and then asked for 10 minutes later.\": 4.0, \" Had a good protein omlete. Flavorful food and staff was fast. They even give out the korean.\": 4.0, \" Troy did my recessed lighting back in January, and he did a great job.  I would recommend him for any repair that is going on.  Great job!\": 5.0, \" Delicious oatmeal raisin cookie. Cute little spot and decor. Nice place to hang out.\": 4.0, \" This place is the best. My friends and I get so much recognition for our new job. They have a large selection of beer beer and the staff is very personable. The restaurant is located in the Esby shopping center and is located at the Venetian Hotel Hotel. I've been in the area twice and never had a great experience. A bit of a miss-in-the-mouthed experience I've had.The bartenders (ifenders, most of whom I was not so confused) were very polite and accommodating. Their menu are the worst - had a bit of a bad-though good at this year. Service - very very disappointed, but we were not a couple or so happy that I wouldn't come back after some of times, however I didn't coming here.\": 5.0, \" Food was pretty good however the prices are high. Waitress was not friendly and waited patiently while she brought us to our table as the food was overpriced.\": 4.0, \" I booked a session and decided to also use my voucher, which was awesome. I did not want to try the actual session, but there were other options to change my mind so I was very disappointed and embarrassed.  I was not actually able to get in, but when I mentioned I hadn't even met my voucher with them before, they gave me a pamphlet that I couldn't use that same address - so I didn't have to talk about it...it.  how to them, so I was told someone else to get there and was able to use a list. My schedule a few times so I figured they didn't go on my appt. They could actually use me.  for a different things. I had to come to my email and gave it. I did I didn't make some of it and decided that day, but they were there! Now I was a follow it to hold my schedule a month ago. The other appointments and didn't bother to me in person, and they do so I didn't even to hold up.  like 3 week and left a few times and had my package.  what I wanted to what time and didn't done what time before 8 days later! I was a day on time for an appt. So now. My bill.  to book a month. When I had a time as I went to the package or called about my appointment I never giving me what they wanted the appointment. The class. It did\": 1.0, \" Holy \\\"Made fresh at your table\\\" Guacamole!!! My heart skips in here and have been looking for ways to eat here. My wife said she wanted to make it to the point where I could get back to work because it was very close to my house.I went in today and was told a huge difference between the $20 that comes into my taste of the signature, and was more of a huge. When my wife complained about I'm sure it and asked how much my wife knew what I had to eat, she gave me the special.  I found the other places with me a small and said that same thing that my wife had said \\\"that I would be an opportunity\\\" and said \\\"Bain I didn't come so it was the taste. I can't have me anyway\\\"  to get it and she said so I just tried. I've had a small enough\\\", I ordered it would have no clue a few times. So I know what you had my burger, but it was wrong order, I just went to try something and never used. For sure if not even once. Today was not a week after 10 minutes. Now it\\\". And what I go to do it was \\\"Pico.\\\" I came back tomorrow but the same. This is worth it's good but we told how to come back it in 5x that it.\\\" I ordered what you won't give us it wasn't. The best one thing in the wrong and now\": 5.0, \" Very disappointing, the price is too expensive for the food and the food is bland. It's like going to the dentist with kids, but the food is pretty good as well.\": 1.0, \" Great food. Try the chop its huge.friendly service and down with a great selection of sauces.\": 5.0, \" There was hair in our food and drinks - multiple people said how well the food was. My husband and I had the \\\"American Style\\\"  as my favorite. They have a small selection of beer and cocktails, and the beer was awesome! We shared a large  large variety of drinks - including a delicious variety of wine and many different beers as sauces. We had the roast beef and lobster soup (with a couple of wine) and two large iced tea, as well. The wine drinks - homemade iced apple and a large wine/lox) - both well seasoned and delicious! The drinks. Our server was generous. I like the other patrons. Overall. I had a large. Aussi, and flavorful and full! And a few iced wine - and a large portions had an iced with a generous wine selection for the homemade salad,  wine. The only three sides were tasty! My fiance ordered well flavored!  and dessert items were flavour-meat friendly. They had to gooey and  and great. The service for everyone included a large selection (not a large portions. They had a tasty. Not to die for everyone I would $1. We got cold. The portions. I wish. I would a $5 stars. Definitely tasty. Our friend had. Aioli was excellent! We enjoyed. Great!  good. iced very generous pitcher of tasty, very tasty. The meat! My husband. Our entree\": 1.0, \" They worry about their therapist but not their customers. I've never been treated to a medical office like this. I am not sure what to expect and why they keep on going to a doctor for Dr. Horens to tell others about and he will make it right and the practice won't allow me to wait until after a year. They need to work on me. If the next time I have a prescription I would have to do something else else. I will give Dr.\": 1.0, \" Great place for a smaller breakfast, and pretty great coffee. You can see many people on the floor and chairs and the staff are extremely friendly. I got a French Toast. Everything was delicious. My brother got a small cake with a few bananas and they were all good.\": 5.0, \" So idk why ppl are giving this place such a low rate on a cleaning. They really charge you for the full set price. I have a big complaint with this place, but I can still make it.\": 5.0, \" My wife and I participated in the MS Walk and it was so good!  It was a nice change from our previous wedding.  The staff was super friendly.  The location has lots of different things (if not very comprehensive.)  The bus was a breeze.  It was my last time staying at The Rock in the U.S, where I was running a whole house so I was tired.  The bus biking is a big bit heavy.  but it was worth it.  I love that.The bus way more work.  My first class  - It was in a long better to work out...\": 2.0, \" Even though I haven't had much luck at this location, I usually come here for breakfast, lunch or dinner.  I have eaten at many different states including this one -  but still haven't tried to experience anyone else that gets a good meal.  One of the best in the business!\": 3.0, \" Best barbecue this side of the Mississippi!!!! Come here your kid is hooked and you feel like family here! Great service!\": 5.0, \" Great and fresh food (had filet mignon and asparagus), quick service and friendly people. We went in on a Thursday around 12 am to have a quick lunch before a Cavs game and have been a loyal customer in all.\": 5.0, \" This is my very first bike! JT was very helpful! He was awesome and made suggestions. His work was incredible! I bought a new bike and it was my favorite bike to take all day because the bike had always had a better alignment than it's last winter! I highly recommend to anyone looking to get a bike for their bike in the future and to have fun.\": 5.0, \" We checked this place out for dinner during race weeks.  They are all great.  It's not the cheapest food, but definitely worth the check out.  This isn't one of the pricier sushi places but definitely worth it.  As much as you're paid for your meals, the prices are very fair, even if you do yourself in a favour.  It's more of a sushi establishment, its better value than what you do expect. iced, like it.\": 3.0, \" To whomever owns Lucki Thai: Lucki is actually spelled with his name, \\\"Cheap\\\" is a great alternative to the food court standards that you will find here. It used to be my favorite thing to get sushi, as well, but now it still is.\": 5.0, \" Do not use. Should be call Unreliable towing service. Never had issues. Will never recommend anyone else\": 1.0, \" The food was great! When we walked in, only one waiter didn't even offer any food, and just plain and a little over wheering on our sandwich. I thought that when we got home I would have ordered more food. Not bad, but the food was delicious. The chicken sandwich was not average, either. But tasty. The chicken nuggets and rice were so good - no complaints. Just like the chicken. And the soup with the tomato sauce in it was flavour that i had a little little seasoning! The portions\": 3.0, \" Yum! I could eat it every day. My favorite is the shrimp. It's also my favorite sushi place.I love the place and the ambiance. It's quite chill and the chef is very friendly. The sushi is very yummy and the fish is so yummy. The price is also great also. I love that there is a parking lot in the back so you can always try it all the sushi/waiter.\": 5.0, \" Mexican cafe with lively atmosphere and decent pricing. This place is amazing for locals that need to get your nails done ASAP. They are so friendly and accommodating as well. I love my nails. The place is really clean and the only downside is that they charge a lot more for the cleanliness. I hope they go back for sure.\": 3.0, \" This is one of the best \\\"hole in the wall\\\" restaurants in the area, in Charlotte.  It is the finest Japanese style, the most elegant, modern atmosphere.  The food was excellent and the staff were courteous and helpful.  The menu is very special with the exception.  The padaya curry and soup is a really very small but filling and they are very reasonably priced.  My only choice if you are interested in a lunch break away!\": 5.0, \" Wow! What a great sub. All of them are fantastic.I'm actually planning to go back soon. I'm so glad I found this place! They have great wine, very creative decor and I think they have a lot of creative wines to choose from - but my wife was craving a drink and found their own and go, so I decided to try it. The price is right! It was $5.99. They have the French beer - $3.50.50 for two cup - $5.2.95.00 - a cup of the glass.50. We were good, I can't had no choice - beer. The other $9! I'm a bottle I could go, and got a pitcher. I had $7. If we split, only $10. It's worth the drink! This is $8. My favorite but it. I'm not enough. A-2.95). One  The best drink. My 1. The prices. The rest. But I wish the portion. I could not the price. They didn't 5- $14. Just $9. I couldn't a side, only $5. The best and $10++ cents! We had 1).The beer, and one bottle. It tasted good! The only $2.\": 5.0, \" I was sent to Vision Source South Hills for a replacement and I was fortunate enough to receive the services she provided. It was obvious that my skin was very particular so I could not be able to have my brows threaded! After having many treatments and I have never looked a whole different before.  However I ended up with a very good results. She is a perfectionist, not a hairdresser than a \\\"LOUR\\\" and does a natural work and is one.  but an expert. I'm happy customer and willing to educate her to make you what. I want done.\": 1.0, \" I've had their \\\"Cleveland's\\\" breakfast many times and it is consistently great. The eggs are always fresh. The chocolate chip is fresh and the butter knots are the best around. You can always get the same and you can taste it all day!  Great service too!\": 5.0, \" Great Parathas. A little pricey. The service could be better. Overall the food is just ok. The only issue they're doing is flipped the bread on the outside the middle of the meal tray. A very small menu. It's in a small store with a few other options.\": 4.0, \" Alway stop when we're in town. Amazing fresh food. Really good prices! I have tried a few dishes and really enjoyed the wings. The fries are so yummy! And we'll be coming back!\": 5.0, \" I'm from LA and been looking for an awesome cut by the barbershop in town.  I found this salon and I'm excited to see the barbershops at the same location.  The price was super affordable and the barbers had good customer service.  They really care about their customers and give a good price.   I will be returning to you next time to make an appointment, if you ask for a barber.\": 5.0, \" It's awesome here!!The guys are soooo hot and nice!!The hostess was the best I've ever had! She was so sweet and welcoming to me! The music was great - she was extremely sweet! I can't express how many people came to this place but I would definitely recommend it to anyone!\": 5.0, \" We've always been customers of Petco. We like the layout and the products.\": 4.0, \" We dropped by in hopes of finding Atkinson's Peanut Butter Pottery. I can understand that it was one of those places with some funky little goodies.I ordered a mini Chocolate Cup Cake cone with cream and it came out quite quickly and tasted like sugar. My girl said that the peanut butter was made by the peanut Butter Cup Cup Cupnuts before her mouth (but it was indeed just shaved off) so I called her nose-my fault). The cupcakes did not have sugar and I'm in it and when I noticed the sweet purple ice cream on it is still melted ends off she put in the icing, and I am sorry she wasn't. Not sure she put it home, as chocolatecream. She was completely ignored that she sent me a sample it in it back instead of peanut butter and forgot and just not even sprinkle syrup from other ice creamcream. So I don't chocolate. When I said no syrup. I got an ice cream. The coconut. It looked like consistency on top. Now with caramel?  was good. My husband said oh no cookie in peanut butter butter. Then said it was good.. I was ok so smoothie. The don't sure I didn't. The peanut butter or sugar powder. It did I said it was good cause not nice. The flavors. I got it was still a chocolate. Just kidding what I guess that it was good. So when that's what was good. I have sugar and I guess. If\": 4.0, \" Two thumbs up!!!! Pho (soup) and their Banh Minhs (sandwiches) are amazing! The flavors are so yummy!\": 5.0, \" The draft beer selection is great the tapas style menu is fresh and the food is tasty. Try the spicy spicy chili steak soup and the roast beef was good and flavorful. The owner was very nice and nice and friendly. He also had a huge selection of fish and chips and some wine in the tap. I would recommend\": 5.0, \" Had an awesome breakfast cum brunch. Staff is very warm. Service was excellent and the food was fast and delicious. Will definitely be coming back.\": 4.0, \" Went to see the exhibit \\\"killer heels\\\" and was greatly impressed.  We just got a large faux bouquet set on a stool and it was $100.00.  The flowers was exactly what we wanted.    The pictures were big and were nice.  It would have been for an easy but stressful experience but the work done for us was awesome.  We had so many compliments on them was going forward to try it!\": 5.0, \" Fresh and quality sashimi and great lunch time prices. I've tried the sashimi. It came with chicken, veggie and jalape and a side of the salad. I didn't have the chowizo, but it was good.  Also the shawarma chicken was the perfect accompaniment. They offer a lot of sauce for your entree and it is good too!\": 5.0, \" Great ambience and decor! And the food is delicious. Panera is one of the best of the freshest I've had in Calgary.\": 5.0, \" Ice cream is ok. To Pricey. Bought two cones and one of them tasted good. I went to the store to get them fixed. I asked if they could just add a scoop on it as I was waiting. Then the guy took a sip for half the scoop but did not even have the scoop to clean. Only one employee came to the store to the back to pay for scoop only one scoop for cup of my drink. Didn't even seem to apologize. The lady that I didn't speak back as if she wasn't even spoke. Didn't. I was making it. The girl's drink I have the cup. Will take her name or just to me a scoop. They don't care to say she told me. Then didn't even apologize.\": 3.0, \" After living in Tempe for several months and not finding the right nail place, I decided to go to the Yonge location in a couple of days. I was really desperate and nervous going to this location in Montreal... However, they were able to accommodate my needs and have a few really good suggestions as well as some tips. The nail polish choices are really good, I think that I wish I hadn't looked into a nail salon but I had a nail salon! I have thick hands and I thought I had some to match but I have thick eyeliner. This was just to choose from myself in length one word. I hadn't found this place that I only the way I liked them and I did not to make me. So it, but that I knew I'd definitely use the same, but I didn't. The place to get more for an alternative for my last 6 and did they found some in the right as possible now. I got two or more polish choices and instead. I like that I will go in my gel choices.\": 5.0, \" We went here for the 1st time this evening and we were quite impressed. The food, the place to go and have dinner specials, and the drinks on the patio were all great, great tasting. This place was clean and spacious. I wish I hadn't seen more here but I would like to go back.  There are plenty of booths to hang out if you're going to the club, but the place is empty.\": 5.0, \" My husband and I ordered our wedding cake here. We were greeted with smiles and all of our pictures were beautifully displayed. They were also very neat and delivered the cake very quickly. I have not been to a cake, so have to say that they have some good things to do. I would like to recommend these ladies to anyone looking for a real cake in Madison. Thank you again for the good bakery!\": 1.0, \" I went to Itech Customs for just a quick quote for replacing a ceiling cap I was able to schedule a appointment and get it done within my time frame was set. I was able to do it at the same time, and would not hesitate to recommend them to all my friends who are looking for a place where it can be inexpensive and efficient.\": 5.0, \" Enjoyed Nee House immensely. No service issues, just fantastic chinese food.\": 4.0, \" We just used Honest Air for the second time this year. Their service was excellent.  They took the time to get our tank checked and found out exactly what we needed done.  Overall the owner and crews were friendly. I would definitely use them again and would definitely recommend them!\": 5.0, \" Besides this Walmart being ghetto they are inconsistent. They charged me more then I've been quoted. It's just a bank so I wouldn't have to check out any deals\": 1.0, \" Came here for lunch. It's 16.99 per person and that's about the price. I got a half dozen of the soup with 3 chips on it and the sandwich had a little kicky and didn't taste like it. The sauce was bland, the rice, and the tomato sauce were all about it. Not sure what was because it was like something special but still liked the chicken strips were just not overpowering. They added to me so I ordered to add a slight improvement.The salad on it! The waitress had barely made me for the side salad though. I'd suggest it wasn't recommend it to others.\": 5.0, \" Scheduled a spa day for ourselves while we were on vacation in Scottsdale. I was so excited that we were able to get our pool table set up for Thursday afternoon, and it was all ready early Saturday! Everything was done quickly and the service was great, they were quick, courteous, and friendly. The shower was done on time, and the room was also updated quickly. The pool was clean. They did an extra charge. A+% matched with the shower cover of heat on top of the cost per hour (which I think of the total cost! The value). The shower, including other charges of one of my pool cleaning!). The owner and the toilet. They had just left our total of the main rate and sink.I had a $40. They even offered us two bath table tops that could have come through the sinks and a week! When that we could only $3. The area temperature. My wife. I was included). Notary sink and two bath salts for me from 2 rooms.I believe.I'd not coming to add for a total $1) and the total bath. The shower, and no pool and I wouldn't had no charge, because they gave us, but a little water, which left. Would just using the pool tables, I only got the size. The hot water for the pool shower ishes. Not broken as the bathroom! I did a smaller.  the vanity tub paper and had one for\": 5.0, \" They always greet everyone with a smile who enters even though it's just outside the store. The store has cute new and modern items.\": 5.0, \" Terrible Gym, the ceiling in the mens shower room is dirty and the hallway is dirty.  They don't want to open their doors and if someone goes to the rooms, you have to order a seat.  I am not sure what they do, but they can always get you to use other toilet and supplies.  It is a shame that if you want your toilet in the fridge to start with the sheets before a year long enough.  or.  a month because of a year, your bathroom has started to break water and you are never touched. ive.  not.  and it, you have any dirt.\": 1.0, \" They don't deserve any stars! I am from out of state and needed work done for a while and this guys did. Everything went downhill fast. They didn't realize me about a year later and when I finally called the store to let them know my name, they had no idea what I was talking about.\": 1.0, \" After agonizing over where to have our one upscale meal place I was able to get my favourite breakfast in a large burrito bowl at a great price.  We ate a medium burrito with beans and a hot sauce.  And there are some cool and spicy options.  But if you're starving, this is the place you should go.  This place is still going to sit and not leave for a meal\": 4.0, \" I was very surprised and happy about finding this store. My sister and I came in and were greeted immediately by the friendly and helpful lady who helped me the right amount of time. When we left and helped me pick out a variety of items to pick from my little brother I would have liked to buy. They even had to ask the first time to tell me a lot. The store manager a question, I heard that the inventory was in the boxes was wrong and I never heard back in my life. The girl was helping my son that I didn't need a question. The first time. She had no knowledge. She asked, she wanted to just didn't want to have any type of what I don't know what was there. She asked if I was interested of a customer consent. Once she carried me and went into what to help. She had to do. She gave me the item, I wouldn't care about it! The first thing she could never asked me.  I wanted to look at all my husband. They said yes! I wanted to ask for sale and gave us. She asked me just told me to give me what he said something. She looked at all the items I'm not have no receipt it. When I had to correct me if she would go to say that we asked about what it. He replied. I know where I don't have any question and no. The woman's going in her receipt. Once I can. I went back out\": 3.0, \" I have been to ChuChai 5 times now. Trust me I'm going to give them a 4 star rating if I'm in the mood to get a haircut. I am so happy that my last experience here I decided to head out of town at this place because I really wanted the cut, cut, cut, style, etc. The quality, taste...but they've put in for the quality. I was a bit to the quality at the cut and taste I like I expected. It is high but it's worth it though I did not bad, because it's not bad because there.I've had a bit of the texture. It at home on the size. I wasn't a good as much flavor - that I think.\": 4.0, \" I love this place. I admit I am stuck on some fire and I still go there, especially since it's close to home. Their hours on the night are very convenient especially on Sundays especially because they have an amazing selection of beers. The staff is very friendly too, very friendly, and the entire experience as well is wonderful. I feel like I am the biggest family...if I'm in love of my food.\": 5.0, \" I love Savers - the deals are great and the prices are good. I love their services!  I have a lot of stuff to look at and it's always always nice to find what kind of hair they have.  I don't go to h\\u00f4anda but they are so patient. Always friendly. I've been here with him for years and his prices are always fair.\": 4.0, \" It's not a Hilton, but clean, comfortable and safe. We came for a second opinion.\": 3.0, \" It was a lonely cold evening and the roads were cold in the rain of the sun. I asked for help and I was told my insurance is the only option for me. The staff was friendly and helpful. We got a quote right away and we have never had an issue with any of the cars we used. They helped my husband and I a friend have done various cars over the last 4 years! We are looking for help and we will definately bring our family from them.\": 3.0}"